zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_CGM.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_MC_CGM.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_MC_CGM
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_MC_CGM_H_)  /* Check if memory map has not been already included */
#define S32K566_MC_CGM_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- MC_CGM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MC_CGM_Peripheral_Access_Layer MC_CGM Peripheral Access Layer
 * @{
 */

/** MC_CGM - Register Layout Typedef */
typedef struct MC_CGM_Struct {
  __IO uint32_t PCFS_SDUR;                         /**< PCFS Step Duration, offset: 0x0, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_3, MC_CGM_4 (missing on MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC1;                        /**< PCFS Divider Change 1, offset: 0x4, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_3 (missing on MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE1;                        /**< PCFS Divider End 1, offset: 0x8, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_3 (missing on MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS1;                        /**< PCFS Divider Start 1, offset: 0xC, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_3 (missing on MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC2;                        /**< PCFS Divider Change 2, offset: 0x10, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_3 (missing on MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE2;                        /**< PCFS Divider End 2, offset: 0x14, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_3 (missing on MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS2;                        /**< PCFS Divider Start 2, offset: 0x18, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_3 (missing on MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC3;                        /**< PCFS Divider Change 3, offset: 0x1C, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_3 (missing on MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE3;                        /**< PCFS Divider End 3, offset: 0x20, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_3 (missing on MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS3;                        /**< PCFS Divider Start 3, offset: 0x24, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_3 (missing on MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC4;                        /**< PCFS Divider Change 4, offset: 0x28, available only on: LPE_MC_CGM, MC_CGM_3 (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE4;                        /**< PCFS Divider End 4, offset: 0x2C, available only on: LPE_MC_CGM, MC_CGM_3 (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS4;                        /**< PCFS Divider Start 4, offset: 0x30, available only on: LPE_MC_CGM, MC_CGM_3 (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC5;                        /**< PCFS Divider Change 5, offset: 0x34, available only on: CPE_MC_CGM, MC_CGM_3, MC_CGM_4 (missing on LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE5;                        /**< PCFS Divider End 5, offset: 0x38, available only on: CPE_MC_CGM, MC_CGM_3, MC_CGM_4 (missing on LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS5;                        /**< PCFS Divider Start 5, offset: 0x3C, available only on: CPE_MC_CGM, MC_CGM_3, MC_CGM_4 (missing on LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC6;                        /**< PCFS Divider Change 6, offset: 0x40, available only on: LPE_MC_CGM (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE6;                        /**< PCFS Divider End 6, offset: 0x44, available only on: LPE_MC_CGM (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS6;                        /**< PCFS Divider Start 6, offset: 0x48, available only on: LPE_MC_CGM (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC7;                        /**< PCFS Divider Change 7, offset: 0x4C, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE7;                        /**< PCFS Divider End 7, offset: 0x50, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS7;                        /**< PCFS Divider Start 7, offset: 0x54, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC8;                        /**< PCFS Divider Change 8, offset: 0x58, available only on: CPE_MC_CGM, LPE_MC_CGM (missing on MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE8;                        /**< PCFS Divider End 8, offset: 0x5C, available only on: CPE_MC_CGM, LPE_MC_CGM (missing on MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS8;                        /**< PCFS Divider Start 8, offset: 0x60, available only on: CPE_MC_CGM, LPE_MC_CGM (missing on MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC9;                        /**< PCFS Divider Change 9, offset: 0x64, available only on: CPE_MC_CGM, MC_CGM_3 (missing on LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE9;                        /**< PCFS Divider End 9, offset: 0x68, available only on: CPE_MC_CGM, MC_CGM_3 (missing on LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS9;                        /**< PCFS Divider Start 9, offset: 0x6C, available only on: CPE_MC_CGM, MC_CGM_3 (missing on LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC10;                       /**< PCFS Divider Change 10, offset: 0x70, available only on: CPE_MC_CGM (missing on LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE10;                       /**< PCFS Divider End 10, offset: 0x74, available only on: CPE_MC_CGM (missing on LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS10;                       /**< PCFS Divider Start 10, offset: 0x78, available only on: CPE_MC_CGM (missing on LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC11;                       /**< PCFS Divider Change 11, offset: 0x7C, available only on: LPE_MC_CGM (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE11;                       /**< PCFS Divider End 11, offset: 0x80, available only on: LPE_MC_CGM (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS11;                       /**< PCFS Divider Start 11, offset: 0x84, available only on: LPE_MC_CGM (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC12;                       /**< PCFS Divider Change 12, offset: 0x88, available only on: LPE_MC_CGM (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE12;                       /**< PCFS Divider End 12, offset: 0x8C, available only on: LPE_MC_CGM (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS12;                       /**< PCFS Divider Start 12, offset: 0x90, available only on: LPE_MC_CGM (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC13;                       /**< PCFS Divider Change 13, offset: 0x94, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE13;                       /**< PCFS Divider End 13, offset: 0x98, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS13;                       /**< PCFS Divider Start 13, offset: 0x9C, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC14;                       /**< PCFS Divider Change 14, offset: 0xA0, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE14;                       /**< PCFS Divider End 14, offset: 0xA4, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS14;                       /**< PCFS Divider Start 14, offset: 0xA8, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC15;                       /**< PCFS Divider Change 15, offset: 0xAC, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE15;                       /**< PCFS Divider End 15, offset: 0xB0, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS15;                       /**< PCFS Divider Start 15, offset: 0xB4, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC16;                       /**< PCFS Divider Change 16, offset: 0xB8, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE16;                       /**< PCFS Divider End 16, offset: 0xBC, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS16;                       /**< PCFS Divider Start 16, offset: 0xC0, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC17;                       /**< PCFS Divider Change 17, offset: 0xC4, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE17;                       /**< PCFS Divider End 17, offset: 0xC8, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS17;                       /**< PCFS Divider Start 17, offset: 0xCC, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC18;                       /**< PCFS Divider Change 18, offset: 0xD0, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE18;                       /**< PCFS Divider End 18, offset: 0xD4, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS18;                       /**< PCFS Divider Start 18, offset: 0xD8, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC19;                       /**< PCFS Divider Change 19, offset: 0xDC, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE19;                       /**< PCFS Divider End 19, offset: 0xE0, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS19;                       /**< PCFS Divider Start 19, offset: 0xE4, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC20;                       /**< PCFS Divider Change 20, offset: 0xE8, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE20;                       /**< PCFS Divider End 20, offset: 0xEC, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS20;                       /**< PCFS Divider Start 20, offset: 0xF0, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  uint8_t RESERVED_0[312];
  __IO uint32_t PCFS_DIVC47;                       /**< PCFS Divider Change 47, offset: 0x22C, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE47;                       /**< PCFS Divider End 47, offset: 0x230, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS47;                       /**< PCFS Divider Start 47, offset: 0x234, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC48;                       /**< PCFS Divider Change 48, offset: 0x238, available only on: LPE_MC_CGM (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE48;                       /**< PCFS Divider End 48, offset: 0x23C, available only on: LPE_MC_CGM (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS48;                       /**< PCFS Divider Start 48, offset: 0x240, available only on: LPE_MC_CGM (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC49;                       /**< PCFS Divider Change 49, offset: 0x244, available only on: LPE_MC_CGM (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE49;                       /**< PCFS Divider End 49, offset: 0x248, available only on: LPE_MC_CGM (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS49;                       /**< PCFS Divider Start 49, offset: 0x24C, available only on: LPE_MC_CGM (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC50;                       /**< PCFS Divider Change 50, offset: 0x250, available only on: LPE_MC_CGM (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE50;                       /**< PCFS Divider End 50, offset: 0x254, available only on: LPE_MC_CGM (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS50;                       /**< PCFS Divider Start 50, offset: 0x258, available only on: LPE_MC_CGM (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC51;                       /**< PCFS Divider Change 51, offset: 0x25C, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE51;                       /**< PCFS Divider End 51, offset: 0x260, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS51;                       /**< PCFS Divider Start 51, offset: 0x264, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVC52;                       /**< PCFS Divider Change 52, offset: 0x268, available only on: LPE_MC_CGM, MC_CGM_3 (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE52;                       /**< PCFS Divider End 52, offset: 0x26C, available only on: LPE_MC_CGM, MC_CGM_3 (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS52;                       /**< PCFS Divider Start 52, offset: 0x270, available only on: LPE_MC_CGM, MC_CGM_3 (missing on CPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  uint8_t RESERVED_1[120];
  __IO uint32_t PCFS_DIVC63;                       /**< PCFS Divider Change 63, offset: 0x2EC, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_3, MC_CGM_4 (missing on MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_5) */
  __IO uint32_t PCFS_DIVE63;                       /**< PCFS Divider End 63, offset: 0x2F0, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_3, MC_CGM_4 (missing on MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_5) */
  __IO uint32_t PCFS_DIVS63;                       /**< PCFS Divider Start 63, offset: 0x2F4, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_3, MC_CGM_4 (missing on MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_5) */
  uint8_t RESERVED_2[8];
  __IO uint32_t SLC_0_CSC;                         /**< Clock Slice 0 Select Control, offset: 0x300, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5 (missing on MC_CGM_1) */
  __I  uint32_t SLC_0_CSS;                         /**< Clock Slice 0 Select Status, offset: 0x304, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5 (missing on MC_CGM_1) */
  __IO uint32_t SLC_0_DC_0;                        /**< Clock Slice 0 Divider 0 Control, offset: 0x308, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5 (missing on MC_CGM_1) */
  __IO uint32_t SLC_0_DC_1;                        /**< Clock Slice 0 Divider 1 Control, offset: 0x30C, available only on: CPE_MC_CGM, MC_CGM_3 (missing on LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_0_DC_2;                        /**< Clock Slice 0 Divider 2 Control, offset: 0x310, available only on: CPE_MC_CGM, MC_CGM_3 (missing on LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_0_DC_3;                        /**< Clock Slice 0 Divider 3 Control, offset: 0x314, available only on: CPE_MC_CGM, MC_CGM_3 (missing on LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  uint8_t RESERVED_3[28];
  __IO uint32_t SLC_0_DIV_TRIG_CTRL;               /**< Clock Slice 0 Divider Trigger Control, offset: 0x334, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_3, MC_CGM_4 (missing on MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_5) */
  __IO uint32_t SLC_0_DIV_TRIG;                    /**< Clock Slice 0 Divider Trigger, offset: 0x338, available only on: CPE_MC_CGM, MC_CGM_3 (missing on LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __I  uint32_t SLC_0_DIV_UPD_STAT;                /**< Clock Slice 0 Divider Update Status, offset: 0x33C, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5 (missing on MC_CGM_1) */
  __IO uint32_t SLC_1_CSC;                         /**< Clock Slice 1 Select Control, offset: 0x340, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_3, MC_CGM_4 (missing on MC_CGM_2, MC_CGM_5) */
  __I  uint32_t SLC_1_CSS;                         /**< Clock Slice 1 Select Status, offset: 0x344, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_3, MC_CGM_4 (missing on MC_CGM_2, MC_CGM_5) */
  __IO uint32_t SLC_1_DC_0;                        /**< Clock Slice 1 Divider 0 Control, offset: 0x348, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_3, MC_CGM_4 (missing on MC_CGM_2, MC_CGM_5) */
  uint8_t RESERVED_4[48];
  __I  uint32_t SLC_1_DIV_UPD_STAT;                /**< Clock Slice 1 Divider Update Status, offset: 0x37C, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_3, MC_CGM_4 (missing on MC_CGM_2, MC_CGM_5) */
  __IO uint32_t SLC_2_CSC;                         /**< Clock Slice 2 Select Control, offset: 0x380, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_3 (missing on MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __I  uint32_t SLC_2_CSS;                         /**< Clock Slice 2 Select Status, offset: 0x384, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_3 (missing on MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_2_DC_0;                        /**< Clock Slice 2 Divider 0 Control, offset: 0x388, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_3 (missing on MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  uint8_t RESERVED_5[48];
  __I  uint32_t SLC_2_DIV_UPD_STAT;                /**< Clock Slice 2 Divider Update Status, offset: 0x3BC, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_3 (missing on MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_3_CSC;                         /**< Clock Slice 3 Select Control, offset: 0x3C0, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_3 (missing on MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __I  uint32_t SLC_3_CSS;                         /**< Clock Slice 3 Select Status, offset: 0x3C4, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_3 (missing on MC_CGM_2, MC_CGM_4, MC_CGM_5) */
