zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_CGM.h
  __IO uint32_t SLC_3_DC_0;                        /**< Clock Slice 3 Divider 0 Control, offset: 0x3C8, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_3 (missing on MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  uint8_t RESERVED_6[48];
  __I  uint32_t SLC_3_DIV_UPD_STAT;                /**< Clock Slice 3 Divider Update Status, offset: 0x3FC, available only on: CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_3 (missing on MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_4_CSC;                         /**< Clock Slice 4 Select Control, offset: 0x400, available only on: LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_3 (missing on CPE_MC_CGM, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __I  uint32_t SLC_4_CSS;                         /**< Clock Slice 4 Select Status, offset: 0x404, available only on: LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_3 (missing on CPE_MC_CGM, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_4_DC_0;                        /**< Clock Slice 4 Divider 0 Control, offset: 0x408, available only on: LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_3 (missing on CPE_MC_CGM, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  uint8_t RESERVED_7[40];
  __IO uint32_t SLC_4_DIV_TRIG_CTRL;               /**< Clock Slice 4 Divider Trigger Control, offset: 0x434, available only on: MC_CGM_1 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  uint8_t RESERVED_8[4];
  __I  uint32_t SLC_4_DIV_UPD_STAT;                /**< Clock Slice 4 Divider Update Status, offset: 0x43C, available only on: LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_3 (missing on CPE_MC_CGM, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_5_CSC;                         /**< Clock Slice 5 Select Control, offset: 0x440, available only on: LPE_MC_CGM, MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __I  uint32_t SLC_5_CSS;                         /**< Clock Slice 5 Select Status, offset: 0x444, available only on: LPE_MC_CGM, MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_5_DC_0;                        /**< Clock Slice 5 Divider 0 Control, offset: 0x448, available only on: LPE_MC_CGM, MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  uint8_t RESERVED_9[48];
  __I  uint32_t SLC_5_DIV_UPD_STAT;                /**< Clock Slice 5 Divider Update Status, offset: 0x47C, available only on: LPE_MC_CGM, MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_6_CSC;                         /**< Clock Slice 6 Select Control, offset: 0x480, available only on: LPE_MC_CGM, MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __I  uint32_t SLC_6_CSS;                         /**< Clock Slice 6 Select Status, offset: 0x484, available only on: LPE_MC_CGM, MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_6_DC_0;                        /**< Clock Slice 6 Divider 0 Control, offset: 0x488, available only on: LPE_MC_CGM, MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  uint8_t RESERVED_10[48];
  __I  uint32_t SLC_6_DIV_UPD_STAT;                /**< Clock Slice 6 Divider Update Status, offset: 0x4BC, available only on: LPE_MC_CGM, MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_7_CSC;                         /**< Clock Slice 7 Select Control, offset: 0x4C0, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __I  uint32_t SLC_7_CSS;                         /**< Clock Slice 7 Select Status, offset: 0x4C4, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_7_DC_0;                        /**< Clock Slice 7 Divider 0 Control, offset: 0x4C8, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  uint8_t RESERVED_11[48];
  __I  uint32_t SLC_7_DIV_UPD_STAT;                /**< Clock Slice 7 Divider Update Status, offset: 0x4FC, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_8_CSC;                         /**< Clock Slice 8 Select Control, offset: 0x500, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __I  uint32_t SLC_8_CSS;                         /**< Clock Slice 8 Select Status, offset: 0x504, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_8_DC_0;                        /**< Clock Slice 8 Divider 0 Control, offset: 0x508, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  uint8_t RESERVED_12[48];
  __I  uint32_t SLC_8_DIV_UPD_STAT;                /**< Clock Slice 8 Divider Update Status, offset: 0x53C, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_9_CSC;                         /**< Clock Slice 9 Select Control, offset: 0x540, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __I  uint32_t SLC_9_CSS;                         /**< Clock Slice 9 Select Status, offset: 0x544, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_9_DC_0;                        /**< Clock Slice 9 Divider 0 Control, offset: 0x548, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  uint8_t RESERVED_13[48];
  __I  uint32_t SLC_9_DIV_UPD_STAT;                /**< Clock Slice 9 Divider Update Status, offset: 0x57C, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_10_CSC;                        /**< Clock Slice 10 Select Control, offset: 0x580, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __I  uint32_t SLC_10_CSS;                        /**< Clock Slice 10 Select Status, offset: 0x584, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_10_DC_0;                       /**< Clock Slice 10 Divider 0 Control, offset: 0x588, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  uint8_t RESERVED_14[40];
  __IO uint32_t SLC_10_DIV_TRIG_CTRL;              /**< Clock Slice 10 Divider Trigger Control, offset: 0x5B4, available only on: MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_0, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  uint8_t RESERVED_15[4];
  __I  uint32_t SLC_10_DIV_UPD_STAT;               /**< Clock Slice 10 Divider Update Status, offset: 0x5BC, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_11_CSC;                        /**< Clock Slice 11 Select Control, offset: 0x5C0, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __I  uint32_t SLC_11_CSS;                        /**< Clock Slice 11 Select Status, offset: 0x5C4, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_11_DC_0;                       /**< Clock Slice 11 Divider 0 Control, offset: 0x5C8, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  uint8_t RESERVED_16[48];
  __I  uint32_t SLC_11_DIV_UPD_STAT;               /**< Clock Slice 11 Divider Update Status, offset: 0x5FC, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_12_CSC;                        /**< Clock Slice 12 Select Control, offset: 0x600, available only on: MC_CGM_0 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __I  uint32_t SLC_12_CSS;                        /**< Clock Slice 12 Select Status, offset: 0x604, available only on: MC_CGM_0 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_12_DC_0;                       /**< Clock Slice 12 Divider 0 Control, offset: 0x608, available only on: MC_CGM_0 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  uint8_t RESERVED_17[48];
  __I  uint32_t SLC_12_DIV_UPD_STAT;               /**< Clock Slice 12 Divider Update Status, offset: 0x63C, available only on: MC_CGM_0 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_13_CSC;                        /**< Clock Slice 13 Select Control, offset: 0x640, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __I  uint32_t SLC_13_CSS;                        /**< Clock Slice 13 Select Status, offset: 0x644, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_13_DC_0;                       /**< Clock Slice 13 Divider 0 Control, offset: 0x648, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  uint8_t RESERVED_18[48];
  __I  uint32_t SLC_13_DIV_UPD_STAT;               /**< Clock Slice 13 Divider Update Status, offset: 0x67C, available only on: MC_CGM_0, MC_CGM_3 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_14_CSC;                        /**< Clock Slice 14 Select Control, offset: 0x680, available only on: MC_CGM_0 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __I  uint32_t SLC_14_CSS;                        /**< Clock Slice 14 Select Status, offset: 0x684, available only on: MC_CGM_0 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  __IO uint32_t SLC_14_DC_0;                       /**< Clock Slice 14 Divider 0 Control, offset: 0x688, available only on: MC_CGM_0 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
  uint8_t RESERVED_19[48];
  __I  uint32_t SLC_14_DIV_UPD_STAT;               /**< Clock Slice 14 Divider Update Status, offset: 0x6BC, available only on: MC_CGM_0 (missing on CPE_MC_CGM, LPE_MC_CGM, MC_CGM_1, MC_CGM_2, MC_CGM_3, MC_CGM_4, MC_CGM_5) */
} MC_CGM_Type, *MC_CGM_MemMapPtr;

/** Number of instances of the MC_CGM module. */
#define MC_CGM_INSTANCE_COUNT                    (8u)

/* MC_CGM - Peripheral instance base addresses */
/** Peripheral CPE_MC_CGM base address */
#define IP_CPE_MC_CGM_BASE                       (0x41074000u)
/** Peripheral CPE_MC_CGM base pointer */
#define IP_CPE_MC_CGM                            ((MC_CGM_Type *)IP_CPE_MC_CGM_BASE)
/** Peripheral LPE_MC_CGM base address */
#define IP_LPE_MC_CGM_BASE                       (0x42120000u)
/** Peripheral LPE_MC_CGM base pointer */
#define IP_LPE_MC_CGM                            ((MC_CGM_Type *)IP_LPE_MC_CGM_BASE)
/** Peripheral MC_CGM_0 base address */
#define IP_MC_CGM_0_BASE                         (0x40094000u)
/** Peripheral MC_CGM_0 base pointer */
#define IP_MC_CGM_0                              ((MC_CGM_Type *)IP_MC_CGM_0_BASE)
/** Peripheral MC_CGM_1 base address */
#define IP_MC_CGM_1_BASE                         (0x40098000u)
/** Peripheral MC_CGM_1 base pointer */
#define IP_MC_CGM_1                              ((MC_CGM_Type *)IP_MC_CGM_1_BASE)
/** Peripheral MC_CGM_2 base address */
#define IP_MC_CGM_2_BASE                         (0x402FC000u)
/** Peripheral MC_CGM_2 base pointer */
#define IP_MC_CGM_2                              ((MC_CGM_Type *)IP_MC_CGM_2_BASE)
/** Peripheral MC_CGM_3 base address */
#define IP_MC_CGM_3_BASE                         (0x404B8000u)
/** Peripheral MC_CGM_3 base pointer */
#define IP_MC_CGM_3                              ((MC_CGM_Type *)IP_MC_CGM_3_BASE)
/** Peripheral MC_CGM_4 base address */
#define IP_MC_CGM_4_BASE                         (0x40B38000u)
/** Peripheral MC_CGM_4 base pointer */
#define IP_MC_CGM_4                              ((MC_CGM_Type *)IP_MC_CGM_4_BASE)
/** Peripheral MC_CGM_5 base address */
#define IP_MC_CGM_5_BASE                         (0x40B3C000u)
/** Peripheral MC_CGM_5 base pointer */
#define IP_MC_CGM_5                              ((MC_CGM_Type *)IP_MC_CGM_5_BASE)
/** Array initializer of MC_CGM peripheral base addresses */
#define IP_MC_CGM_BASE_ADDRS                     { IP_CPE_MC_CGM_BASE, IP_LPE_MC_CGM_BASE, IP_MC_CGM_0_BASE, IP_MC_CGM_1_BASE, IP_MC_CGM_2_BASE, IP_MC_CGM_3_BASE, IP_MC_CGM_4_BASE, IP_MC_CGM_5_BASE }
/** Array initializer of MC_CGM peripheral base pointers */
#define IP_MC_CGM_BASE_PTRS                      { IP_CPE_MC_CGM, IP_LPE_MC_CGM, IP_MC_CGM_0, IP_MC_CGM_1, IP_MC_CGM_2, IP_MC_CGM_3, IP_MC_CGM_4, IP_MC_CGM_5 }

/* ----------------------------------------------------------------------------
   -- MC_CGM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MC_CGM_Register_Masks MC_CGM Register Masks
 * @{
 */

