zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_CGM.h
/*! @name PCFS_SDUR - PCFS Step Duration */
/*! @{ */

#define MC_CGM_PCFS_SDUR_SDUR_MASK               (0xFFFFU)
#define MC_CGM_PCFS_SDUR_SDUR_SHIFT              (0U)
#define MC_CGM_PCFS_SDUR_SDUR_WIDTH              (16U)
#define MC_CGM_PCFS_SDUR_SDUR(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_SDUR_SDUR_SHIFT)) & MC_CGM_PCFS_SDUR_SDUR_MASK)
/*! @} */

/*! @name PCFS_DIVC1 - PCFS Divider Change 1 */
/*! @{ */

#define MC_CGM_PCFS_DIVC1_RATE_MASK              (0xFFU)
#define MC_CGM_PCFS_DIVC1_RATE_SHIFT             (0U)
#define MC_CGM_PCFS_DIVC1_RATE_WIDTH             (8U)
#define MC_CGM_PCFS_DIVC1_RATE(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC1_RATE_SHIFT)) & MC_CGM_PCFS_DIVC1_RATE_MASK)

#define MC_CGM_PCFS_DIVC1_INIT_MASK              (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC1_INIT_SHIFT             (16U)
#define MC_CGM_PCFS_DIVC1_INIT_WIDTH             (16U)
#define MC_CGM_PCFS_DIVC1_INIT(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC1_INIT_SHIFT)) & MC_CGM_PCFS_DIVC1_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE1 - PCFS Divider End 1 */
/*! @{ */

#define MC_CGM_PCFS_DIVE1_DIVE_MASK              (0xFFFFFU)
#define MC_CGM_PCFS_DIVE1_DIVE_SHIFT             (0U)
#define MC_CGM_PCFS_DIVE1_DIVE_WIDTH             (20U)
#define MC_CGM_PCFS_DIVE1_DIVE(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE1_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE1_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS1 - PCFS Divider Start 1 */
/*! @{ */

#define MC_CGM_PCFS_DIVS1_DIVS_MASK              (0xFFFFFU)
#define MC_CGM_PCFS_DIVS1_DIVS_SHIFT             (0U)
#define MC_CGM_PCFS_DIVS1_DIVS_WIDTH             (20U)
#define MC_CGM_PCFS_DIVS1_DIVS(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS1_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS1_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC2 - PCFS Divider Change 2 */
/*! @{ */

#define MC_CGM_PCFS_DIVC2_RATE_MASK              (0xFFU)
#define MC_CGM_PCFS_DIVC2_RATE_SHIFT             (0U)
#define MC_CGM_PCFS_DIVC2_RATE_WIDTH             (8U)
#define MC_CGM_PCFS_DIVC2_RATE(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC2_RATE_SHIFT)) & MC_CGM_PCFS_DIVC2_RATE_MASK)

#define MC_CGM_PCFS_DIVC2_INIT_MASK              (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC2_INIT_SHIFT             (16U)
#define MC_CGM_PCFS_DIVC2_INIT_WIDTH             (16U)
#define MC_CGM_PCFS_DIVC2_INIT(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC2_INIT_SHIFT)) & MC_CGM_PCFS_DIVC2_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE2 - PCFS Divider End 2 */
/*! @{ */

#define MC_CGM_PCFS_DIVE2_DIVE_MASK              (0xFFFFFU)
#define MC_CGM_PCFS_DIVE2_DIVE_SHIFT             (0U)
#define MC_CGM_PCFS_DIVE2_DIVE_WIDTH             (20U)
#define MC_CGM_PCFS_DIVE2_DIVE(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE2_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE2_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS2 - PCFS Divider Start 2 */
/*! @{ */

#define MC_CGM_PCFS_DIVS2_DIVS_MASK              (0xFFFFFU)
#define MC_CGM_PCFS_DIVS2_DIVS_SHIFT             (0U)
#define MC_CGM_PCFS_DIVS2_DIVS_WIDTH             (20U)
#define MC_CGM_PCFS_DIVS2_DIVS(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS2_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS2_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC3 - PCFS Divider Change 3 */
/*! @{ */

#define MC_CGM_PCFS_DIVC3_RATE_MASK              (0xFFU)
#define MC_CGM_PCFS_DIVC3_RATE_SHIFT             (0U)
#define MC_CGM_PCFS_DIVC3_RATE_WIDTH             (8U)
#define MC_CGM_PCFS_DIVC3_RATE(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC3_RATE_SHIFT)) & MC_CGM_PCFS_DIVC3_RATE_MASK)

#define MC_CGM_PCFS_DIVC3_INIT_MASK              (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC3_INIT_SHIFT             (16U)
#define MC_CGM_PCFS_DIVC3_INIT_WIDTH             (16U)
#define MC_CGM_PCFS_DIVC3_INIT(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC3_INIT_SHIFT)) & MC_CGM_PCFS_DIVC3_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE3 - PCFS Divider End 3 */
/*! @{ */

#define MC_CGM_PCFS_DIVE3_DIVE_MASK              (0xFFFFFU)
#define MC_CGM_PCFS_DIVE3_DIVE_SHIFT             (0U)
#define MC_CGM_PCFS_DIVE3_DIVE_WIDTH             (20U)
#define MC_CGM_PCFS_DIVE3_DIVE(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE3_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE3_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS3 - PCFS Divider Start 3 */
/*! @{ */

#define MC_CGM_PCFS_DIVS3_DIVS_MASK              (0xFFFFFU)
#define MC_CGM_PCFS_DIVS3_DIVS_SHIFT             (0U)
#define MC_CGM_PCFS_DIVS3_DIVS_WIDTH             (20U)
#define MC_CGM_PCFS_DIVS3_DIVS(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS3_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS3_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC4 - PCFS Divider Change 4 */
/*! @{ */

#define MC_CGM_PCFS_DIVC4_RATE_MASK              (0xFFU)
#define MC_CGM_PCFS_DIVC4_RATE_SHIFT             (0U)
#define MC_CGM_PCFS_DIVC4_RATE_WIDTH             (8U)
#define MC_CGM_PCFS_DIVC4_RATE(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC4_RATE_SHIFT)) & MC_CGM_PCFS_DIVC4_RATE_MASK)

#define MC_CGM_PCFS_DIVC4_INIT_MASK              (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC4_INIT_SHIFT             (16U)
#define MC_CGM_PCFS_DIVC4_INIT_WIDTH             (16U)
#define MC_CGM_PCFS_DIVC4_INIT(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC4_INIT_SHIFT)) & MC_CGM_PCFS_DIVC4_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE4 - PCFS Divider End 4 */
/*! @{ */

#define MC_CGM_PCFS_DIVE4_DIVE_MASK              (0xFFFFFU)
#define MC_CGM_PCFS_DIVE4_DIVE_SHIFT             (0U)
#define MC_CGM_PCFS_DIVE4_DIVE_WIDTH             (20U)
#define MC_CGM_PCFS_DIVE4_DIVE(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE4_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE4_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS4 - PCFS Divider Start 4 */
/*! @{ */

#define MC_CGM_PCFS_DIVS4_DIVS_MASK              (0xFFFFFU)
#define MC_CGM_PCFS_DIVS4_DIVS_SHIFT             (0U)
#define MC_CGM_PCFS_DIVS4_DIVS_WIDTH             (20U)
#define MC_CGM_PCFS_DIVS4_DIVS(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS4_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS4_DIVS_MASK)
/*! @} */

