zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_CGM.h
/*! @name PCFS_DIVC5 - PCFS Divider Change 5 */
/*! @{ */

#define MC_CGM_PCFS_DIVC5_RATE_MASK              (0xFFU)
#define MC_CGM_PCFS_DIVC5_RATE_SHIFT             (0U)
#define MC_CGM_PCFS_DIVC5_RATE_WIDTH             (8U)
#define MC_CGM_PCFS_DIVC5_RATE(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC5_RATE_SHIFT)) & MC_CGM_PCFS_DIVC5_RATE_MASK)

#define MC_CGM_PCFS_DIVC5_INIT_MASK              (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC5_INIT_SHIFT             (16U)
#define MC_CGM_PCFS_DIVC5_INIT_WIDTH             (16U)
#define MC_CGM_PCFS_DIVC5_INIT(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC5_INIT_SHIFT)) & MC_CGM_PCFS_DIVC5_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE5 - PCFS Divider End 5 */
/*! @{ */

#define MC_CGM_PCFS_DIVE5_DIVE_MASK              (0xFFFFFU)
#define MC_CGM_PCFS_DIVE5_DIVE_SHIFT             (0U)
#define MC_CGM_PCFS_DIVE5_DIVE_WIDTH             (20U)
#define MC_CGM_PCFS_DIVE5_DIVE(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE5_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE5_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS5 - PCFS Divider Start 5 */
/*! @{ */

#define MC_CGM_PCFS_DIVS5_DIVS_MASK              (0xFFFFFU)
#define MC_CGM_PCFS_DIVS5_DIVS_SHIFT             (0U)
#define MC_CGM_PCFS_DIVS5_DIVS_WIDTH             (20U)
#define MC_CGM_PCFS_DIVS5_DIVS(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS5_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS5_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC6 - PCFS Divider Change 6 */
/*! @{ */

#define MC_CGM_PCFS_DIVC6_RATE_MASK              (0xFFU)
#define MC_CGM_PCFS_DIVC6_RATE_SHIFT             (0U)
#define MC_CGM_PCFS_DIVC6_RATE_WIDTH             (8U)
#define MC_CGM_PCFS_DIVC6_RATE(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC6_RATE_SHIFT)) & MC_CGM_PCFS_DIVC6_RATE_MASK)

#define MC_CGM_PCFS_DIVC6_INIT_MASK              (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC6_INIT_SHIFT             (16U)
#define MC_CGM_PCFS_DIVC6_INIT_WIDTH             (16U)
#define MC_CGM_PCFS_DIVC6_INIT(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC6_INIT_SHIFT)) & MC_CGM_PCFS_DIVC6_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE6 - PCFS Divider End 6 */
/*! @{ */

#define MC_CGM_PCFS_DIVE6_DIVE_MASK              (0xFFFFFU)
#define MC_CGM_PCFS_DIVE6_DIVE_SHIFT             (0U)
#define MC_CGM_PCFS_DIVE6_DIVE_WIDTH             (20U)
#define MC_CGM_PCFS_DIVE6_DIVE(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE6_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE6_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS6 - PCFS Divider Start 6 */
/*! @{ */

#define MC_CGM_PCFS_DIVS6_DIVS_MASK              (0xFFFFFU)
#define MC_CGM_PCFS_DIVS6_DIVS_SHIFT             (0U)
#define MC_CGM_PCFS_DIVS6_DIVS_WIDTH             (20U)
#define MC_CGM_PCFS_DIVS6_DIVS(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS6_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS6_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC7 - PCFS Divider Change 7 */
/*! @{ */

#define MC_CGM_PCFS_DIVC7_RATE_MASK              (0xFFU)
#define MC_CGM_PCFS_DIVC7_RATE_SHIFT             (0U)
#define MC_CGM_PCFS_DIVC7_RATE_WIDTH             (8U)
#define MC_CGM_PCFS_DIVC7_RATE(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC7_RATE_SHIFT)) & MC_CGM_PCFS_DIVC7_RATE_MASK)

#define MC_CGM_PCFS_DIVC7_INIT_MASK              (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC7_INIT_SHIFT             (16U)
#define MC_CGM_PCFS_DIVC7_INIT_WIDTH             (16U)
#define MC_CGM_PCFS_DIVC7_INIT(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC7_INIT_SHIFT)) & MC_CGM_PCFS_DIVC7_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE7 - PCFS Divider End 7 */
/*! @{ */

#define MC_CGM_PCFS_DIVE7_DIVE_MASK              (0xFFFFFU)
#define MC_CGM_PCFS_DIVE7_DIVE_SHIFT             (0U)
#define MC_CGM_PCFS_DIVE7_DIVE_WIDTH             (20U)
#define MC_CGM_PCFS_DIVE7_DIVE(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE7_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE7_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS7 - PCFS Divider Start 7 */
/*! @{ */

#define MC_CGM_PCFS_DIVS7_DIVS_MASK              (0xFFFFFU)
#define MC_CGM_PCFS_DIVS7_DIVS_SHIFT             (0U)
#define MC_CGM_PCFS_DIVS7_DIVS_WIDTH             (20U)
#define MC_CGM_PCFS_DIVS7_DIVS(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS7_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS7_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC8 - PCFS Divider Change 8 */
/*! @{ */

#define MC_CGM_PCFS_DIVC8_RATE_MASK              (0xFFU)
#define MC_CGM_PCFS_DIVC8_RATE_SHIFT             (0U)
#define MC_CGM_PCFS_DIVC8_RATE_WIDTH             (8U)
#define MC_CGM_PCFS_DIVC8_RATE(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC8_RATE_SHIFT)) & MC_CGM_PCFS_DIVC8_RATE_MASK)

#define MC_CGM_PCFS_DIVC8_INIT_MASK              (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC8_INIT_SHIFT             (16U)
#define MC_CGM_PCFS_DIVC8_INIT_WIDTH             (16U)
#define MC_CGM_PCFS_DIVC8_INIT(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC8_INIT_SHIFT)) & MC_CGM_PCFS_DIVC8_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE8 - PCFS Divider End 8 */
/*! @{ */

#define MC_CGM_PCFS_DIVE8_DIVE_MASK              (0xFFFFFU)
#define MC_CGM_PCFS_DIVE8_DIVE_SHIFT             (0U)
#define MC_CGM_PCFS_DIVE8_DIVE_WIDTH             (20U)
#define MC_CGM_PCFS_DIVE8_DIVE(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE8_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE8_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS8 - PCFS Divider Start 8 */
/*! @{ */

#define MC_CGM_PCFS_DIVS8_DIVS_MASK              (0xFFFFFU)
#define MC_CGM_PCFS_DIVS8_DIVS_SHIFT             (0U)
#define MC_CGM_PCFS_DIVS8_DIVS_WIDTH             (20U)
#define MC_CGM_PCFS_DIVS8_DIVS(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS8_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS8_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC9 - PCFS Divider Change 9 */
/*! @{ */

#define MC_CGM_PCFS_DIVC9_RATE_MASK              (0xFFU)
#define MC_CGM_PCFS_DIVC9_RATE_SHIFT             (0U)
#define MC_CGM_PCFS_DIVC9_RATE_WIDTH             (8U)
#define MC_CGM_PCFS_DIVC9_RATE(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC9_RATE_SHIFT)) & MC_CGM_PCFS_DIVC9_RATE_MASK)

#define MC_CGM_PCFS_DIVC9_INIT_MASK              (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC9_INIT_SHIFT             (16U)
#define MC_CGM_PCFS_DIVC9_INIT_WIDTH             (16U)
#define MC_CGM_PCFS_DIVC9_INIT(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC9_INIT_SHIFT)) & MC_CGM_PCFS_DIVC9_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE9 - PCFS Divider End 9 */
/*! @{ */

#define MC_CGM_PCFS_DIVE9_DIVE_MASK              (0xFFFFFU)
#define MC_CGM_PCFS_DIVE9_DIVE_SHIFT             (0U)
#define MC_CGM_PCFS_DIVE9_DIVE_WIDTH             (20U)
#define MC_CGM_PCFS_DIVE9_DIVE(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE9_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE9_DIVE_MASK)
/*! @} */

