zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_CGM.h
/*! @name PCFS_DIVS9 - PCFS Divider Start 9 */
/*! @{ */

#define MC_CGM_PCFS_DIVS9_DIVS_MASK              (0xFFFFFU)
#define MC_CGM_PCFS_DIVS9_DIVS_SHIFT             (0U)
#define MC_CGM_PCFS_DIVS9_DIVS_WIDTH             (20U)
#define MC_CGM_PCFS_DIVS9_DIVS(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS9_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS9_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC10 - PCFS Divider Change 10 */
/*! @{ */

#define MC_CGM_PCFS_DIVC10_RATE_MASK             (0xFFU)
#define MC_CGM_PCFS_DIVC10_RATE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVC10_RATE_WIDTH            (8U)
#define MC_CGM_PCFS_DIVC10_RATE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC10_RATE_SHIFT)) & MC_CGM_PCFS_DIVC10_RATE_MASK)

#define MC_CGM_PCFS_DIVC10_INIT_MASK             (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC10_INIT_SHIFT            (16U)
#define MC_CGM_PCFS_DIVC10_INIT_WIDTH            (16U)
#define MC_CGM_PCFS_DIVC10_INIT(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC10_INIT_SHIFT)) & MC_CGM_PCFS_DIVC10_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE10 - PCFS Divider End 10 */
/*! @{ */

#define MC_CGM_PCFS_DIVE10_DIVE_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVE10_DIVE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVE10_DIVE_WIDTH            (20U)
#define MC_CGM_PCFS_DIVE10_DIVE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE10_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE10_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS10 - PCFS Divider Start 10 */
/*! @{ */

#define MC_CGM_PCFS_DIVS10_DIVS_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVS10_DIVS_SHIFT            (0U)
#define MC_CGM_PCFS_DIVS10_DIVS_WIDTH            (20U)
#define MC_CGM_PCFS_DIVS10_DIVS(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS10_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS10_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC11 - PCFS Divider Change 11 */
/*! @{ */

#define MC_CGM_PCFS_DIVC11_RATE_MASK             (0xFFU)
#define MC_CGM_PCFS_DIVC11_RATE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVC11_RATE_WIDTH            (8U)
#define MC_CGM_PCFS_DIVC11_RATE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC11_RATE_SHIFT)) & MC_CGM_PCFS_DIVC11_RATE_MASK)

#define MC_CGM_PCFS_DIVC11_INIT_MASK             (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC11_INIT_SHIFT            (16U)
#define MC_CGM_PCFS_DIVC11_INIT_WIDTH            (16U)
#define MC_CGM_PCFS_DIVC11_INIT(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC11_INIT_SHIFT)) & MC_CGM_PCFS_DIVC11_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE11 - PCFS Divider End 11 */
/*! @{ */

#define MC_CGM_PCFS_DIVE11_DIVE_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVE11_DIVE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVE11_DIVE_WIDTH            (20U)
#define MC_CGM_PCFS_DIVE11_DIVE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE11_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE11_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS11 - PCFS Divider Start 11 */
/*! @{ */

#define MC_CGM_PCFS_DIVS11_DIVS_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVS11_DIVS_SHIFT            (0U)
#define MC_CGM_PCFS_DIVS11_DIVS_WIDTH            (20U)
#define MC_CGM_PCFS_DIVS11_DIVS(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS11_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS11_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC12 - PCFS Divider Change 12 */
/*! @{ */

#define MC_CGM_PCFS_DIVC12_RATE_MASK             (0xFFU)
#define MC_CGM_PCFS_DIVC12_RATE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVC12_RATE_WIDTH            (8U)
#define MC_CGM_PCFS_DIVC12_RATE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC12_RATE_SHIFT)) & MC_CGM_PCFS_DIVC12_RATE_MASK)

#define MC_CGM_PCFS_DIVC12_INIT_MASK             (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC12_INIT_SHIFT            (16U)
#define MC_CGM_PCFS_DIVC12_INIT_WIDTH            (16U)
#define MC_CGM_PCFS_DIVC12_INIT(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC12_INIT_SHIFT)) & MC_CGM_PCFS_DIVC12_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE12 - PCFS Divider End 12 */
/*! @{ */

#define MC_CGM_PCFS_DIVE12_DIVE_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVE12_DIVE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVE12_DIVE_WIDTH            (20U)
#define MC_CGM_PCFS_DIVE12_DIVE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE12_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE12_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS12 - PCFS Divider Start 12 */
/*! @{ */

#define MC_CGM_PCFS_DIVS12_DIVS_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVS12_DIVS_SHIFT            (0U)
#define MC_CGM_PCFS_DIVS12_DIVS_WIDTH            (20U)
#define MC_CGM_PCFS_DIVS12_DIVS(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS12_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS12_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC13 - PCFS Divider Change 13 */
/*! @{ */

#define MC_CGM_PCFS_DIVC13_RATE_MASK             (0xFFU)
#define MC_CGM_PCFS_DIVC13_RATE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVC13_RATE_WIDTH            (8U)
#define MC_CGM_PCFS_DIVC13_RATE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC13_RATE_SHIFT)) & MC_CGM_PCFS_DIVC13_RATE_MASK)

#define MC_CGM_PCFS_DIVC13_INIT_MASK             (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC13_INIT_SHIFT            (16U)
#define MC_CGM_PCFS_DIVC13_INIT_WIDTH            (16U)
#define MC_CGM_PCFS_DIVC13_INIT(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC13_INIT_SHIFT)) & MC_CGM_PCFS_DIVC13_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE13 - PCFS Divider End 13 */
/*! @{ */

#define MC_CGM_PCFS_DIVE13_DIVE_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVE13_DIVE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVE13_DIVE_WIDTH            (20U)
#define MC_CGM_PCFS_DIVE13_DIVE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE13_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE13_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS13 - PCFS Divider Start 13 */
/*! @{ */

#define MC_CGM_PCFS_DIVS13_DIVS_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVS13_DIVS_SHIFT            (0U)
#define MC_CGM_PCFS_DIVS13_DIVS_WIDTH            (20U)
#define MC_CGM_PCFS_DIVS13_DIVS(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS13_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS13_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC14 - PCFS Divider Change 14 */
/*! @{ */

#define MC_CGM_PCFS_DIVC14_RATE_MASK             (0xFFU)
#define MC_CGM_PCFS_DIVC14_RATE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVC14_RATE_WIDTH            (8U)
#define MC_CGM_PCFS_DIVC14_RATE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC14_RATE_SHIFT)) & MC_CGM_PCFS_DIVC14_RATE_MASK)

