zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_CGM.h
#define MC_CGM_PCFS_DIVC14_INIT_MASK             (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC14_INIT_SHIFT            (16U)
#define MC_CGM_PCFS_DIVC14_INIT_WIDTH            (16U)
#define MC_CGM_PCFS_DIVC14_INIT(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC14_INIT_SHIFT)) & MC_CGM_PCFS_DIVC14_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE14 - PCFS Divider End 14 */
/*! @{ */

#define MC_CGM_PCFS_DIVE14_DIVE_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVE14_DIVE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVE14_DIVE_WIDTH            (20U)
#define MC_CGM_PCFS_DIVE14_DIVE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE14_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE14_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS14 - PCFS Divider Start 14 */
/*! @{ */

#define MC_CGM_PCFS_DIVS14_DIVS_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVS14_DIVS_SHIFT            (0U)
#define MC_CGM_PCFS_DIVS14_DIVS_WIDTH            (20U)
#define MC_CGM_PCFS_DIVS14_DIVS(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS14_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS14_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC15 - PCFS Divider Change 15 */
/*! @{ */

#define MC_CGM_PCFS_DIVC15_RATE_MASK             (0xFFU)
#define MC_CGM_PCFS_DIVC15_RATE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVC15_RATE_WIDTH            (8U)
#define MC_CGM_PCFS_DIVC15_RATE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC15_RATE_SHIFT)) & MC_CGM_PCFS_DIVC15_RATE_MASK)

#define MC_CGM_PCFS_DIVC15_INIT_MASK             (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC15_INIT_SHIFT            (16U)
#define MC_CGM_PCFS_DIVC15_INIT_WIDTH            (16U)
#define MC_CGM_PCFS_DIVC15_INIT(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC15_INIT_SHIFT)) & MC_CGM_PCFS_DIVC15_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE15 - PCFS Divider End 15 */
/*! @{ */

#define MC_CGM_PCFS_DIVE15_DIVE_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVE15_DIVE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVE15_DIVE_WIDTH            (20U)
#define MC_CGM_PCFS_DIVE15_DIVE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE15_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE15_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS15 - PCFS Divider Start 15 */
/*! @{ */

#define MC_CGM_PCFS_DIVS15_DIVS_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVS15_DIVS_SHIFT            (0U)
#define MC_CGM_PCFS_DIVS15_DIVS_WIDTH            (20U)
#define MC_CGM_PCFS_DIVS15_DIVS(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS15_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS15_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC16 - PCFS Divider Change 16 */
/*! @{ */

#define MC_CGM_PCFS_DIVC16_RATE_MASK             (0xFFU)
#define MC_CGM_PCFS_DIVC16_RATE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVC16_RATE_WIDTH            (8U)
#define MC_CGM_PCFS_DIVC16_RATE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC16_RATE_SHIFT)) & MC_CGM_PCFS_DIVC16_RATE_MASK)

#define MC_CGM_PCFS_DIVC16_INIT_MASK             (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC16_INIT_SHIFT            (16U)
#define MC_CGM_PCFS_DIVC16_INIT_WIDTH            (16U)
#define MC_CGM_PCFS_DIVC16_INIT(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC16_INIT_SHIFT)) & MC_CGM_PCFS_DIVC16_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE16 - PCFS Divider End 16 */
/*! @{ */

#define MC_CGM_PCFS_DIVE16_DIVE_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVE16_DIVE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVE16_DIVE_WIDTH            (20U)
#define MC_CGM_PCFS_DIVE16_DIVE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE16_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE16_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS16 - PCFS Divider Start 16 */
/*! @{ */

#define MC_CGM_PCFS_DIVS16_DIVS_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVS16_DIVS_SHIFT            (0U)
#define MC_CGM_PCFS_DIVS16_DIVS_WIDTH            (20U)
#define MC_CGM_PCFS_DIVS16_DIVS(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS16_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS16_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC17 - PCFS Divider Change 17 */
/*! @{ */

#define MC_CGM_PCFS_DIVC17_RATE_MASK             (0xFFU)
#define MC_CGM_PCFS_DIVC17_RATE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVC17_RATE_WIDTH            (8U)
#define MC_CGM_PCFS_DIVC17_RATE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC17_RATE_SHIFT)) & MC_CGM_PCFS_DIVC17_RATE_MASK)

#define MC_CGM_PCFS_DIVC17_INIT_MASK             (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC17_INIT_SHIFT            (16U)
#define MC_CGM_PCFS_DIVC17_INIT_WIDTH            (16U)
#define MC_CGM_PCFS_DIVC17_INIT(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC17_INIT_SHIFT)) & MC_CGM_PCFS_DIVC17_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE17 - PCFS Divider End 17 */
/*! @{ */

#define MC_CGM_PCFS_DIVE17_DIVE_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVE17_DIVE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVE17_DIVE_WIDTH            (20U)
#define MC_CGM_PCFS_DIVE17_DIVE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE17_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE17_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS17 - PCFS Divider Start 17 */
/*! @{ */

#define MC_CGM_PCFS_DIVS17_DIVS_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVS17_DIVS_SHIFT            (0U)
#define MC_CGM_PCFS_DIVS17_DIVS_WIDTH            (20U)
#define MC_CGM_PCFS_DIVS17_DIVS(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS17_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS17_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC18 - PCFS Divider Change 18 */
/*! @{ */

#define MC_CGM_PCFS_DIVC18_RATE_MASK             (0xFFU)
#define MC_CGM_PCFS_DIVC18_RATE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVC18_RATE_WIDTH            (8U)
#define MC_CGM_PCFS_DIVC18_RATE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC18_RATE_SHIFT)) & MC_CGM_PCFS_DIVC18_RATE_MASK)

#define MC_CGM_PCFS_DIVC18_INIT_MASK             (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC18_INIT_SHIFT            (16U)
#define MC_CGM_PCFS_DIVC18_INIT_WIDTH            (16U)
#define MC_CGM_PCFS_DIVC18_INIT(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC18_INIT_SHIFT)) & MC_CGM_PCFS_DIVC18_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE18 - PCFS Divider End 18 */
/*! @{ */

#define MC_CGM_PCFS_DIVE18_DIVE_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVE18_DIVE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVE18_DIVE_WIDTH            (20U)
#define MC_CGM_PCFS_DIVE18_DIVE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE18_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE18_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS18 - PCFS Divider Start 18 */
/*! @{ */

#define MC_CGM_PCFS_DIVS18_DIVS_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVS18_DIVS_SHIFT            (0U)
#define MC_CGM_PCFS_DIVS18_DIVS_WIDTH            (20U)
#define MC_CGM_PCFS_DIVS18_DIVS(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS18_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS18_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC19 - PCFS Divider Change 19 */
/*! @{ */

#define MC_CGM_PCFS_DIVC19_RATE_MASK             (0xFFU)
#define MC_CGM_PCFS_DIVC19_RATE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVC19_RATE_WIDTH            (8U)
#define MC_CGM_PCFS_DIVC19_RATE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC19_RATE_SHIFT)) & MC_CGM_PCFS_DIVC19_RATE_MASK)

#define MC_CGM_PCFS_DIVC19_INIT_MASK             (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC19_INIT_SHIFT            (16U)
#define MC_CGM_PCFS_DIVC19_INIT_WIDTH            (16U)
#define MC_CGM_PCFS_DIVC19_INIT(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC19_INIT_SHIFT)) & MC_CGM_PCFS_DIVC19_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE19 - PCFS Divider End 19 */
/*! @{ */

#define MC_CGM_PCFS_DIVE19_DIVE_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVE19_DIVE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVE19_DIVE_WIDTH            (20U)
#define MC_CGM_PCFS_DIVE19_DIVE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE19_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE19_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS19 - PCFS Divider Start 19 */
/*! @{ */

#define MC_CGM_PCFS_DIVS19_DIVS_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVS19_DIVS_SHIFT            (0U)
#define MC_CGM_PCFS_DIVS19_DIVS_WIDTH            (20U)
#define MC_CGM_PCFS_DIVS19_DIVS(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS19_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS19_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC20 - PCFS Divider Change 20 */
/*! @{ */

