zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_CGM.h
#define MC_CGM_PCFS_DIVC20_RATE_MASK             (0xFFU)
#define MC_CGM_PCFS_DIVC20_RATE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVC20_RATE_WIDTH            (8U)
#define MC_CGM_PCFS_DIVC20_RATE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC20_RATE_SHIFT)) & MC_CGM_PCFS_DIVC20_RATE_MASK)

#define MC_CGM_PCFS_DIVC20_INIT_MASK             (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC20_INIT_SHIFT            (16U)
#define MC_CGM_PCFS_DIVC20_INIT_WIDTH            (16U)
#define MC_CGM_PCFS_DIVC20_INIT(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC20_INIT_SHIFT)) & MC_CGM_PCFS_DIVC20_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE20 - PCFS Divider End 20 */
/*! @{ */

#define MC_CGM_PCFS_DIVE20_DIVE_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVE20_DIVE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVE20_DIVE_WIDTH            (20U)
#define MC_CGM_PCFS_DIVE20_DIVE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE20_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE20_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS20 - PCFS Divider Start 20 */
/*! @{ */

#define MC_CGM_PCFS_DIVS20_DIVS_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVS20_DIVS_SHIFT            (0U)
#define MC_CGM_PCFS_DIVS20_DIVS_WIDTH            (20U)
#define MC_CGM_PCFS_DIVS20_DIVS(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS20_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS20_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC47 - PCFS Divider Change 47 */
/*! @{ */

#define MC_CGM_PCFS_DIVC47_RATE_MASK             (0xFFU)
#define MC_CGM_PCFS_DIVC47_RATE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVC47_RATE_WIDTH            (8U)
#define MC_CGM_PCFS_DIVC47_RATE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC47_RATE_SHIFT)) & MC_CGM_PCFS_DIVC47_RATE_MASK)

#define MC_CGM_PCFS_DIVC47_INIT_MASK             (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC47_INIT_SHIFT            (16U)
#define MC_CGM_PCFS_DIVC47_INIT_WIDTH            (16U)
#define MC_CGM_PCFS_DIVC47_INIT(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC47_INIT_SHIFT)) & MC_CGM_PCFS_DIVC47_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE47 - PCFS Divider End 47 */
/*! @{ */

#define MC_CGM_PCFS_DIVE47_DIVE_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVE47_DIVE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVE47_DIVE_WIDTH            (20U)
#define MC_CGM_PCFS_DIVE47_DIVE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE47_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE47_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS47 - PCFS Divider Start 47 */
/*! @{ */

#define MC_CGM_PCFS_DIVS47_DIVS_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVS47_DIVS_SHIFT            (0U)
#define MC_CGM_PCFS_DIVS47_DIVS_WIDTH            (20U)
#define MC_CGM_PCFS_DIVS47_DIVS(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS47_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS47_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC48 - PCFS Divider Change 48 */
/*! @{ */

#define MC_CGM_PCFS_DIVC48_RATE_MASK             (0xFFU)
#define MC_CGM_PCFS_DIVC48_RATE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVC48_RATE_WIDTH            (8U)
#define MC_CGM_PCFS_DIVC48_RATE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC48_RATE_SHIFT)) & MC_CGM_PCFS_DIVC48_RATE_MASK)

#define MC_CGM_PCFS_DIVC48_INIT_MASK             (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC48_INIT_SHIFT            (16U)
#define MC_CGM_PCFS_DIVC48_INIT_WIDTH            (16U)
#define MC_CGM_PCFS_DIVC48_INIT(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC48_INIT_SHIFT)) & MC_CGM_PCFS_DIVC48_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE48 - PCFS Divider End 48 */
/*! @{ */

#define MC_CGM_PCFS_DIVE48_DIVE_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVE48_DIVE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVE48_DIVE_WIDTH            (20U)
#define MC_CGM_PCFS_DIVE48_DIVE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE48_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE48_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS48 - PCFS Divider Start 48 */
/*! @{ */

#define MC_CGM_PCFS_DIVS48_DIVS_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVS48_DIVS_SHIFT            (0U)
#define MC_CGM_PCFS_DIVS48_DIVS_WIDTH            (20U)
#define MC_CGM_PCFS_DIVS48_DIVS(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS48_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS48_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC49 - PCFS Divider Change 49 */
/*! @{ */

#define MC_CGM_PCFS_DIVC49_RATE_MASK             (0xFFU)
#define MC_CGM_PCFS_DIVC49_RATE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVC49_RATE_WIDTH            (8U)
#define MC_CGM_PCFS_DIVC49_RATE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC49_RATE_SHIFT)) & MC_CGM_PCFS_DIVC49_RATE_MASK)

#define MC_CGM_PCFS_DIVC49_INIT_MASK             (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC49_INIT_SHIFT            (16U)
#define MC_CGM_PCFS_DIVC49_INIT_WIDTH            (16U)
#define MC_CGM_PCFS_DIVC49_INIT(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC49_INIT_SHIFT)) & MC_CGM_PCFS_DIVC49_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE49 - PCFS Divider End 49 */
/*! @{ */

#define MC_CGM_PCFS_DIVE49_DIVE_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVE49_DIVE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVE49_DIVE_WIDTH            (20U)
#define MC_CGM_PCFS_DIVE49_DIVE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE49_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE49_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS49 - PCFS Divider Start 49 */
/*! @{ */

#define MC_CGM_PCFS_DIVS49_DIVS_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVS49_DIVS_SHIFT            (0U)
#define MC_CGM_PCFS_DIVS49_DIVS_WIDTH            (20U)
#define MC_CGM_PCFS_DIVS49_DIVS(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS49_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS49_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC50 - PCFS Divider Change 50 */
/*! @{ */

#define MC_CGM_PCFS_DIVC50_RATE_MASK             (0xFFU)
#define MC_CGM_PCFS_DIVC50_RATE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVC50_RATE_WIDTH            (8U)
#define MC_CGM_PCFS_DIVC50_RATE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC50_RATE_SHIFT)) & MC_CGM_PCFS_DIVC50_RATE_MASK)

