zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_CGM.h
#define MC_CGM_PCFS_DIVC50_INIT_MASK             (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC50_INIT_SHIFT            (16U)
#define MC_CGM_PCFS_DIVC50_INIT_WIDTH            (16U)
#define MC_CGM_PCFS_DIVC50_INIT(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC50_INIT_SHIFT)) & MC_CGM_PCFS_DIVC50_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE50 - PCFS Divider End 50 */
/*! @{ */

#define MC_CGM_PCFS_DIVE50_DIVE_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVE50_DIVE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVE50_DIVE_WIDTH            (20U)
#define MC_CGM_PCFS_DIVE50_DIVE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE50_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE50_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS50 - PCFS Divider Start 50 */
/*! @{ */

#define MC_CGM_PCFS_DIVS50_DIVS_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVS50_DIVS_SHIFT            (0U)
#define MC_CGM_PCFS_DIVS50_DIVS_WIDTH            (20U)
#define MC_CGM_PCFS_DIVS50_DIVS(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS50_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS50_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC51 - PCFS Divider Change 51 */
/*! @{ */

#define MC_CGM_PCFS_DIVC51_RATE_MASK             (0xFFU)
#define MC_CGM_PCFS_DIVC51_RATE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVC51_RATE_WIDTH            (8U)
#define MC_CGM_PCFS_DIVC51_RATE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC51_RATE_SHIFT)) & MC_CGM_PCFS_DIVC51_RATE_MASK)

#define MC_CGM_PCFS_DIVC51_INIT_MASK             (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC51_INIT_SHIFT            (16U)
#define MC_CGM_PCFS_DIVC51_INIT_WIDTH            (16U)
#define MC_CGM_PCFS_DIVC51_INIT(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC51_INIT_SHIFT)) & MC_CGM_PCFS_DIVC51_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE51 - PCFS Divider End 51 */
/*! @{ */

#define MC_CGM_PCFS_DIVE51_DIVE_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVE51_DIVE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVE51_DIVE_WIDTH            (20U)
#define MC_CGM_PCFS_DIVE51_DIVE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE51_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE51_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS51 - PCFS Divider Start 51 */
/*! @{ */

#define MC_CGM_PCFS_DIVS51_DIVS_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVS51_DIVS_SHIFT            (0U)
#define MC_CGM_PCFS_DIVS51_DIVS_WIDTH            (20U)
#define MC_CGM_PCFS_DIVS51_DIVS(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS51_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS51_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC52 - PCFS Divider Change 52 */
/*! @{ */

#define MC_CGM_PCFS_DIVC52_RATE_MASK             (0xFFU)
#define MC_CGM_PCFS_DIVC52_RATE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVC52_RATE_WIDTH            (8U)
#define MC_CGM_PCFS_DIVC52_RATE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC52_RATE_SHIFT)) & MC_CGM_PCFS_DIVC52_RATE_MASK)

#define MC_CGM_PCFS_DIVC52_INIT_MASK             (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC52_INIT_SHIFT            (16U)
#define MC_CGM_PCFS_DIVC52_INIT_WIDTH            (16U)
#define MC_CGM_PCFS_DIVC52_INIT(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC52_INIT_SHIFT)) & MC_CGM_PCFS_DIVC52_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE52 - PCFS Divider End 52 */
/*! @{ */

#define MC_CGM_PCFS_DIVE52_DIVE_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVE52_DIVE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVE52_DIVE_WIDTH            (20U)
#define MC_CGM_PCFS_DIVE52_DIVE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE52_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE52_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS52 - PCFS Divider Start 52 */
/*! @{ */

#define MC_CGM_PCFS_DIVS52_DIVS_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVS52_DIVS_SHIFT            (0U)
#define MC_CGM_PCFS_DIVS52_DIVS_WIDTH            (20U)
#define MC_CGM_PCFS_DIVS52_DIVS(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS52_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS52_DIVS_MASK)
/*! @} */

/*! @name PCFS_DIVC63 - PCFS Divider Change 63 */
/*! @{ */

#define MC_CGM_PCFS_DIVC63_RATE_MASK             (0xFFU)
#define MC_CGM_PCFS_DIVC63_RATE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVC63_RATE_WIDTH            (8U)
#define MC_CGM_PCFS_DIVC63_RATE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC63_RATE_SHIFT)) & MC_CGM_PCFS_DIVC63_RATE_MASK)

#define MC_CGM_PCFS_DIVC63_INIT_MASK             (0xFFFF0000U)
#define MC_CGM_PCFS_DIVC63_INIT_SHIFT            (16U)
#define MC_CGM_PCFS_DIVC63_INIT_WIDTH            (16U)
#define MC_CGM_PCFS_DIVC63_INIT(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVC63_INIT_SHIFT)) & MC_CGM_PCFS_DIVC63_INIT_MASK)
/*! @} */

/*! @name PCFS_DIVE63 - PCFS Divider End 63 */
/*! @{ */

#define MC_CGM_PCFS_DIVE63_DIVE_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVE63_DIVE_SHIFT            (0U)
#define MC_CGM_PCFS_DIVE63_DIVE_WIDTH            (20U)
#define MC_CGM_PCFS_DIVE63_DIVE(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVE63_DIVE_SHIFT)) & MC_CGM_PCFS_DIVE63_DIVE_MASK)
/*! @} */

/*! @name PCFS_DIVS63 - PCFS Divider Start 63 */
/*! @{ */

#define MC_CGM_PCFS_DIVS63_DIVS_MASK             (0xFFFFFU)
#define MC_CGM_PCFS_DIVS63_DIVS_SHIFT            (0U)
#define MC_CGM_PCFS_DIVS63_DIVS_WIDTH            (20U)
#define MC_CGM_PCFS_DIVS63_DIVS(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_PCFS_DIVS63_DIVS_SHIFT)) & MC_CGM_PCFS_DIVS63_DIVS_MASK)
/*! @} */

/*! @name SLC_0_CSC - Clock Slice 0 Select Control */
/*! @{ */

#define MC_CGM_SLC_0_CSC_RMP_SW_MASK             (0x2U)
#define MC_CGM_SLC_0_CSC_RMP_SW_SHIFT            (1U)
#define MC_CGM_SLC_0_CSC_RMP_SW_WIDTH            (1U)
#define MC_CGM_SLC_0_CSC_RMP_SW(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_CSC_RMP_SW_SHIFT)) & MC_CGM_SLC_0_CSC_RMP_SW_MASK)

#define MC_CGM_SLC_0_CSC_CLK_SW_MASK             (0x4U)
#define MC_CGM_SLC_0_CSC_CLK_SW_SHIFT            (2U)
#define MC_CGM_SLC_0_CSC_CLK_SW_WIDTH            (1U)
#define MC_CGM_SLC_0_CSC_CLK_SW(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_CSC_CLK_SW_SHIFT)) & MC_CGM_SLC_0_CSC_CLK_SW_MASK)

#define MC_CGM_SLC_0_CSC_SAFE_SW_MASK            (0x8U)
#define MC_CGM_SLC_0_CSC_SAFE_SW_SHIFT           (3U)
#define MC_CGM_SLC_0_CSC_SAFE_SW_WIDTH           (1U)
#define MC_CGM_SLC_0_CSC_SAFE_SW(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_CSC_SAFE_SW_SHIFT)) & MC_CGM_SLC_0_CSC_SAFE_SW_MASK)

