zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_CGM.h
#define MC_CGM_SLC_0_CSC_SELCTL_MASK             (0x3F000000U)
#define MC_CGM_SLC_0_CSC_SELCTL_SHIFT            (24U)
#define MC_CGM_SLC_0_CSC_SELCTL_WIDTH            (6U)
#define MC_CGM_SLC_0_CSC_SELCTL(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_CSC_SELCTL_SHIFT)) & MC_CGM_SLC_0_CSC_SELCTL_MASK)
/*! @} */

/*! @name SLC_0_CSS - Clock Slice 0 Select Status */
/*! @{ */

#define MC_CGM_SLC_0_CSS_SWIP_MASK               (0x4U)
#define MC_CGM_SLC_0_CSS_SWIP_SHIFT              (2U)
#define MC_CGM_SLC_0_CSS_SWIP_WIDTH              (1U)
#define MC_CGM_SLC_0_CSS_SWIP(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_CSS_SWIP_SHIFT)) & MC_CGM_SLC_0_CSS_SWIP_MASK)

#define MC_CGM_SLC_0_CSS_SAFESWIP_MASK           (0x8U)
#define MC_CGM_SLC_0_CSS_SAFESWIP_SHIFT          (3U)
#define MC_CGM_SLC_0_CSS_SAFESWIP_WIDTH          (1U)
#define MC_CGM_SLC_0_CSS_SAFESWIP(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_CSS_SAFESWIP_SHIFT)) & MC_CGM_SLC_0_CSS_SAFESWIP_MASK)

#define MC_CGM_SLC_0_CSS_SWTRG_MASK              (0x70000U)
#define MC_CGM_SLC_0_CSS_SWTRG_SHIFT             (16U)
#define MC_CGM_SLC_0_CSS_SWTRG_WIDTH             (3U)
#define MC_CGM_SLC_0_CSS_SWTRG(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_CSS_SWTRG_SHIFT)) & MC_CGM_SLC_0_CSS_SWTRG_MASK)

#define MC_CGM_SLC_0_CSS_SELSTAT_MASK            (0x3F000000U)
#define MC_CGM_SLC_0_CSS_SELSTAT_SHIFT           (24U)
#define MC_CGM_SLC_0_CSS_SELSTAT_WIDTH           (6U)
#define MC_CGM_SLC_0_CSS_SELSTAT(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_CSS_SELSTAT_SHIFT)) & MC_CGM_SLC_0_CSS_SELSTAT_MASK)
/*! @} */

/*! @name SLC_0_DC_0 - Clock Slice 0 Divider 0 Control */
/*! @{ */

#define MC_CGM_SLC_0_DC_0_DIV_MASK               (0xFF0000U)  /* Merged from fields with different position or width, of widths (1, 2, 8), largest definition used */
#define MC_CGM_SLC_0_DC_0_DIV_SHIFT              (16U)
#define MC_CGM_SLC_0_DC_0_DIV_WIDTH              (8U)
#define MC_CGM_SLC_0_DC_0_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_DC_0_DIV_SHIFT)) & MC_CGM_SLC_0_DC_0_DIV_MASK)  /* Merged from fields with different position or width, of widths (1, 2, 8), largest definition used */

#define MC_CGM_SLC_0_DC_0_DE_MASK                (0x80000000U)
#define MC_CGM_SLC_0_DC_0_DE_SHIFT               (31U)
#define MC_CGM_SLC_0_DC_0_DE_WIDTH               (1U)
#define MC_CGM_SLC_0_DC_0_DE(x)                  (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_DC_0_DE_SHIFT)) & MC_CGM_SLC_0_DC_0_DE_MASK)
/*! @} */

/*! @name SLC_0_DC_1 - Clock Slice 0 Divider 1 Control */
/*! @{ */

#define MC_CGM_SLC_0_DC_1_DIV_MASK               (0xFF0000U)  /* Merged from fields with different position or width, of widths (1, 8), largest definition used */
#define MC_CGM_SLC_0_DC_1_DIV_SHIFT              (16U)
#define MC_CGM_SLC_0_DC_1_DIV_WIDTH              (8U)
#define MC_CGM_SLC_0_DC_1_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_DC_1_DIV_SHIFT)) & MC_CGM_SLC_0_DC_1_DIV_MASK)  /* Merged from fields with different position or width, of widths (1, 8), largest definition used */

#define MC_CGM_SLC_0_DC_1_DE_MASK                (0x80000000U)
#define MC_CGM_SLC_0_DC_1_DE_SHIFT               (31U)
#define MC_CGM_SLC_0_DC_1_DE_WIDTH               (1U)
#define MC_CGM_SLC_0_DC_1_DE(x)                  (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_DC_1_DE_SHIFT)) & MC_CGM_SLC_0_DC_1_DE_MASK)
/*! @} */

/*! @name SLC_0_DC_2 - Clock Slice 0 Divider 2 Control */
/*! @{ */

#define MC_CGM_SLC_0_DC_2_DIV_MASK               (0xFF0000U)  /* Merged from fields with different position or width, of widths (2, 8), largest definition used */
#define MC_CGM_SLC_0_DC_2_DIV_SHIFT              (16U)
#define MC_CGM_SLC_0_DC_2_DIV_WIDTH              (8U)
#define MC_CGM_SLC_0_DC_2_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_DC_2_DIV_SHIFT)) & MC_CGM_SLC_0_DC_2_DIV_MASK)  /* Merged from fields with different position or width, of widths (2, 8), largest definition used */

#define MC_CGM_SLC_0_DC_2_DE_MASK                (0x80000000U)
#define MC_CGM_SLC_0_DC_2_DE_SHIFT               (31U)
#define MC_CGM_SLC_0_DC_2_DE_WIDTH               (1U)
#define MC_CGM_SLC_0_DC_2_DE(x)                  (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_DC_2_DE_SHIFT)) & MC_CGM_SLC_0_DC_2_DE_MASK)
/*! @} */

/*! @name SLC_0_DC_3 - Clock Slice 0 Divider 3 Control */
/*! @{ */

#define MC_CGM_SLC_0_DC_3_DIV_MASK               (0xFF0000U)  /* Merged from fields with different position or width, of widths (3, 8), largest definition used */
#define MC_CGM_SLC_0_DC_3_DIV_SHIFT              (16U)
#define MC_CGM_SLC_0_DC_3_DIV_WIDTH              (8U)
#define MC_CGM_SLC_0_DC_3_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_DC_3_DIV_SHIFT)) & MC_CGM_SLC_0_DC_3_DIV_MASK)  /* Merged from fields with different position or width, of widths (3, 8), largest definition used */

#define MC_CGM_SLC_0_DC_3_DE_MASK                (0x80000000U)
#define MC_CGM_SLC_0_DC_3_DE_SHIFT               (31U)
#define MC_CGM_SLC_0_DC_3_DE_WIDTH               (1U)
#define MC_CGM_SLC_0_DC_3_DE(x)                  (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_DC_3_DE_SHIFT)) & MC_CGM_SLC_0_DC_3_DE_MASK)
/*! @} */

/*! @name SLC_0_DIV_TRIG_CTRL - Clock Slice 0 Divider Trigger Control */
/*! @{ */

#define MC_CGM_SLC_0_DIV_TRIG_CTRL_TCTL_MASK     (0x1U)
#define MC_CGM_SLC_0_DIV_TRIG_CTRL_TCTL_SHIFT    (0U)
#define MC_CGM_SLC_0_DIV_TRIG_CTRL_TCTL_WIDTH    (1U)
#define MC_CGM_SLC_0_DIV_TRIG_CTRL_TCTL(x)       (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_DIV_TRIG_CTRL_TCTL_SHIFT)) & MC_CGM_SLC_0_DIV_TRIG_CTRL_TCTL_MASK)

#define MC_CGM_SLC_0_DIV_TRIG_CTRL_IRE_MASK      (0x10000U)
#define MC_CGM_SLC_0_DIV_TRIG_CTRL_IRE_SHIFT     (16U)
#define MC_CGM_SLC_0_DIV_TRIG_CTRL_IRE_WIDTH     (1U)
#define MC_CGM_SLC_0_DIV_TRIG_CTRL_IRE(x)        (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_DIV_TRIG_CTRL_IRE_SHIFT)) & MC_CGM_SLC_0_DIV_TRIG_CTRL_IRE_MASK)

#define MC_CGM_SLC_0_DIV_TRIG_CTRL_HHEN_MASK     (0x80000000U)
#define MC_CGM_SLC_0_DIV_TRIG_CTRL_HHEN_SHIFT    (31U)
#define MC_CGM_SLC_0_DIV_TRIG_CTRL_HHEN_WIDTH    (1U)
#define MC_CGM_SLC_0_DIV_TRIG_CTRL_HHEN(x)       (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_DIV_TRIG_CTRL_HHEN_SHIFT)) & MC_CGM_SLC_0_DIV_TRIG_CTRL_HHEN_MASK)
/*! @} */

