zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_CGM.h
/*! @name SLC_0_DIV_TRIG - Clock Slice 0 Divider Trigger */
/*! @{ */

#define MC_CGM_SLC_0_DIV_TRIG_TRIGGER_MASK       (0xFFFFFFFFU)
#define MC_CGM_SLC_0_DIV_TRIG_TRIGGER_SHIFT      (0U)
#define MC_CGM_SLC_0_DIV_TRIG_TRIGGER_WIDTH      (32U)
#define MC_CGM_SLC_0_DIV_TRIG_TRIGGER(x)         (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_DIV_TRIG_TRIGGER_SHIFT)) & MC_CGM_SLC_0_DIV_TRIG_TRIGGER_MASK)
/*! @} */

/*! @name SLC_0_DIV_UPD_STAT - Clock Slice 0 Divider Update Status */
/*! @{ */

#define MC_CGM_SLC_0_DIV_UPD_STAT_DIV_STAT_MASK  (0x1U)
#define MC_CGM_SLC_0_DIV_UPD_STAT_DIV_STAT_SHIFT (0U)
#define MC_CGM_SLC_0_DIV_UPD_STAT_DIV_STAT_WIDTH (1U)
#define MC_CGM_SLC_0_DIV_UPD_STAT_DIV_STAT(x)    (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_0_DIV_UPD_STAT_DIV_STAT_SHIFT)) & MC_CGM_SLC_0_DIV_UPD_STAT_DIV_STAT_MASK)
/*! @} */

/*! @name SLC_1_CSC - Clock Slice 1 Select Control */
/*! @{ */

#define MC_CGM_SLC_1_CSC_CLK_SW_MASK             (0x4U)
#define MC_CGM_SLC_1_CSC_CLK_SW_SHIFT            (2U)
#define MC_CGM_SLC_1_CSC_CLK_SW_WIDTH            (1U)
#define MC_CGM_SLC_1_CSC_CLK_SW(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_1_CSC_CLK_SW_SHIFT)) & MC_CGM_SLC_1_CSC_CLK_SW_MASK)

#define MC_CGM_SLC_1_CSC_SAFE_SW_MASK            (0x8U)
#define MC_CGM_SLC_1_CSC_SAFE_SW_SHIFT           (3U)
#define MC_CGM_SLC_1_CSC_SAFE_SW_WIDTH           (1U)
#define MC_CGM_SLC_1_CSC_SAFE_SW(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_1_CSC_SAFE_SW_SHIFT)) & MC_CGM_SLC_1_CSC_SAFE_SW_MASK)

#define MC_CGM_SLC_1_CSC_SELCTL_MASK             (0x3F000000U)
#define MC_CGM_SLC_1_CSC_SELCTL_SHIFT            (24U)
#define MC_CGM_SLC_1_CSC_SELCTL_WIDTH            (6U)
#define MC_CGM_SLC_1_CSC_SELCTL(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_1_CSC_SELCTL_SHIFT)) & MC_CGM_SLC_1_CSC_SELCTL_MASK)
/*! @} */

/*! @name SLC_1_CSS - Clock Slice 1 Select Status */
/*! @{ */

#define MC_CGM_SLC_1_CSS_SWIP_MASK               (0x4U)
#define MC_CGM_SLC_1_CSS_SWIP_SHIFT              (2U)
#define MC_CGM_SLC_1_CSS_SWIP_WIDTH              (1U)
#define MC_CGM_SLC_1_CSS_SWIP(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_1_CSS_SWIP_SHIFT)) & MC_CGM_SLC_1_CSS_SWIP_MASK)

#define MC_CGM_SLC_1_CSS_SAFESWIP_MASK           (0x8U)
#define MC_CGM_SLC_1_CSS_SAFESWIP_SHIFT          (3U)
#define MC_CGM_SLC_1_CSS_SAFESWIP_WIDTH          (1U)
#define MC_CGM_SLC_1_CSS_SAFESWIP(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_1_CSS_SAFESWIP_SHIFT)) & MC_CGM_SLC_1_CSS_SAFESWIP_MASK)

#define MC_CGM_SLC_1_CSS_SWTRG_MASK              (0x70000U)
#define MC_CGM_SLC_1_CSS_SWTRG_SHIFT             (16U)
#define MC_CGM_SLC_1_CSS_SWTRG_WIDTH             (3U)
#define MC_CGM_SLC_1_CSS_SWTRG(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_1_CSS_SWTRG_SHIFT)) & MC_CGM_SLC_1_CSS_SWTRG_MASK)

#define MC_CGM_SLC_1_CSS_SELSTAT_MASK            (0x3F000000U)
#define MC_CGM_SLC_1_CSS_SELSTAT_SHIFT           (24U)
#define MC_CGM_SLC_1_CSS_SELSTAT_WIDTH           (6U)
#define MC_CGM_SLC_1_CSS_SELSTAT(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_1_CSS_SELSTAT_SHIFT)) & MC_CGM_SLC_1_CSS_SELSTAT_MASK)
/*! @} */

/*! @name SLC_1_DC_0 - Clock Slice 1 Divider 0 Control */
/*! @{ */

#define MC_CGM_SLC_1_DC_0_DIV_MASK               (0xFF0000U)  /* Merged from fields with different position or width, of widths (3, 4, 5, 8), largest definition used */
#define MC_CGM_SLC_1_DC_0_DIV_SHIFT              (16U)
#define MC_CGM_SLC_1_DC_0_DIV_WIDTH              (8U)
#define MC_CGM_SLC_1_DC_0_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_1_DC_0_DIV_SHIFT)) & MC_CGM_SLC_1_DC_0_DIV_MASK)  /* Merged from fields with different position or width, of widths (3, 4, 5, 8), largest definition used */

#define MC_CGM_SLC_1_DC_0_DE_MASK                (0x80000000U)
#define MC_CGM_SLC_1_DC_0_DE_SHIFT               (31U)
#define MC_CGM_SLC_1_DC_0_DE_WIDTH               (1U)
#define MC_CGM_SLC_1_DC_0_DE(x)                  (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_1_DC_0_DE_SHIFT)) & MC_CGM_SLC_1_DC_0_DE_MASK)
/*! @} */

/*! @name SLC_1_DIV_UPD_STAT - Clock Slice 1 Divider Update Status */
/*! @{ */

#define MC_CGM_SLC_1_DIV_UPD_STAT_DIV_STAT_MASK  (0x1U)
#define MC_CGM_SLC_1_DIV_UPD_STAT_DIV_STAT_SHIFT (0U)
#define MC_CGM_SLC_1_DIV_UPD_STAT_DIV_STAT_WIDTH (1U)
#define MC_CGM_SLC_1_DIV_UPD_STAT_DIV_STAT(x)    (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_1_DIV_UPD_STAT_DIV_STAT_SHIFT)) & MC_CGM_SLC_1_DIV_UPD_STAT_DIV_STAT_MASK)
/*! @} */

/*! @name SLC_2_CSC - Clock Slice 2 Select Control */
/*! @{ */

#define MC_CGM_SLC_2_CSC_CLK_SW_MASK             (0x4U)
#define MC_CGM_SLC_2_CSC_CLK_SW_SHIFT            (2U)
#define MC_CGM_SLC_2_CSC_CLK_SW_WIDTH            (1U)
#define MC_CGM_SLC_2_CSC_CLK_SW(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_2_CSC_CLK_SW_SHIFT)) & MC_CGM_SLC_2_CSC_CLK_SW_MASK)

#define MC_CGM_SLC_2_CSC_SAFE_SW_MASK            (0x8U)
#define MC_CGM_SLC_2_CSC_SAFE_SW_SHIFT           (3U)
#define MC_CGM_SLC_2_CSC_SAFE_SW_WIDTH           (1U)
#define MC_CGM_SLC_2_CSC_SAFE_SW(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_2_CSC_SAFE_SW_SHIFT)) & MC_CGM_SLC_2_CSC_SAFE_SW_MASK)

#define MC_CGM_SLC_2_CSC_SELCTL_MASK             (0x3F000000U)
#define MC_CGM_SLC_2_CSC_SELCTL_SHIFT            (24U)
#define MC_CGM_SLC_2_CSC_SELCTL_WIDTH            (6U)
#define MC_CGM_SLC_2_CSC_SELCTL(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_2_CSC_SELCTL_SHIFT)) & MC_CGM_SLC_2_CSC_SELCTL_MASK)
/*! @} */

/*! @name SLC_2_CSS - Clock Slice 2 Select Status */
/*! @{ */

#define MC_CGM_SLC_2_CSS_SWIP_MASK               (0x4U)
#define MC_CGM_SLC_2_CSS_SWIP_SHIFT              (2U)
#define MC_CGM_SLC_2_CSS_SWIP_WIDTH              (1U)
#define MC_CGM_SLC_2_CSS_SWIP(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_2_CSS_SWIP_SHIFT)) & MC_CGM_SLC_2_CSS_SWIP_MASK)

#define MC_CGM_SLC_2_CSS_SAFESWIP_MASK           (0x8U)
#define MC_CGM_SLC_2_CSS_SAFESWIP_SHIFT          (3U)
#define MC_CGM_SLC_2_CSS_SAFESWIP_WIDTH          (1U)
#define MC_CGM_SLC_2_CSS_SAFESWIP(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_2_CSS_SAFESWIP_SHIFT)) & MC_CGM_SLC_2_CSS_SAFESWIP_MASK)

