zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_CGM.h
#define MC_CGM_SLC_9_CSS_SELSTAT_MASK            (0x3F000000U)
#define MC_CGM_SLC_9_CSS_SELSTAT_SHIFT           (24U)
#define MC_CGM_SLC_9_CSS_SELSTAT_WIDTH           (6U)
#define MC_CGM_SLC_9_CSS_SELSTAT(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_9_CSS_SELSTAT_SHIFT)) & MC_CGM_SLC_9_CSS_SELSTAT_MASK)
/*! @} */

/*! @name SLC_9_DC_0 - Clock Slice 9 Divider 0 Control */
/*! @{ */

#define MC_CGM_SLC_9_DC_0_DIV_MASK               (0xF0000U)  /* Merged from fields with different position or width, of widths (3, 4), largest definition used */
#define MC_CGM_SLC_9_DC_0_DIV_SHIFT              (16U)
#define MC_CGM_SLC_9_DC_0_DIV_WIDTH              (4U)
#define MC_CGM_SLC_9_DC_0_DIV(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_9_DC_0_DIV_SHIFT)) & MC_CGM_SLC_9_DC_0_DIV_MASK)  /* Merged from fields with different position or width, of widths (3, 4), largest definition used */

#define MC_CGM_SLC_9_DC_0_DE_MASK                (0x80000000U)
#define MC_CGM_SLC_9_DC_0_DE_SHIFT               (31U)
#define MC_CGM_SLC_9_DC_0_DE_WIDTH               (1U)
#define MC_CGM_SLC_9_DC_0_DE(x)                  (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_9_DC_0_DE_SHIFT)) & MC_CGM_SLC_9_DC_0_DE_MASK)
/*! @} */

/*! @name SLC_9_DIV_UPD_STAT - Clock Slice 9 Divider Update Status */
/*! @{ */

#define MC_CGM_SLC_9_DIV_UPD_STAT_DIV_STAT_MASK  (0x1U)
#define MC_CGM_SLC_9_DIV_UPD_STAT_DIV_STAT_SHIFT (0U)
#define MC_CGM_SLC_9_DIV_UPD_STAT_DIV_STAT_WIDTH (1U)
#define MC_CGM_SLC_9_DIV_UPD_STAT_DIV_STAT(x)    (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_9_DIV_UPD_STAT_DIV_STAT_SHIFT)) & MC_CGM_SLC_9_DIV_UPD_STAT_DIV_STAT_MASK)
/*! @} */

/*! @name SLC_10_CSC - Clock Slice 10 Select Control */
/*! @{ */

#define MC_CGM_SLC_10_CSC_CLK_SW_MASK            (0x4U)
#define MC_CGM_SLC_10_CSC_CLK_SW_SHIFT           (2U)
#define MC_CGM_SLC_10_CSC_CLK_SW_WIDTH           (1U)
#define MC_CGM_SLC_10_CSC_CLK_SW(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_10_CSC_CLK_SW_SHIFT)) & MC_CGM_SLC_10_CSC_CLK_SW_MASK)

#define MC_CGM_SLC_10_CSC_SAFE_SW_MASK           (0x8U)
#define MC_CGM_SLC_10_CSC_SAFE_SW_SHIFT          (3U)
#define MC_CGM_SLC_10_CSC_SAFE_SW_WIDTH          (1U)
#define MC_CGM_SLC_10_CSC_SAFE_SW(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_10_CSC_SAFE_SW_SHIFT)) & MC_CGM_SLC_10_CSC_SAFE_SW_MASK)

#define MC_CGM_SLC_10_CSC_SELCTL_MASK            (0x3F000000U)
#define MC_CGM_SLC_10_CSC_SELCTL_SHIFT           (24U)
#define MC_CGM_SLC_10_CSC_SELCTL_WIDTH           (6U)
#define MC_CGM_SLC_10_CSC_SELCTL(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_10_CSC_SELCTL_SHIFT)) & MC_CGM_SLC_10_CSC_SELCTL_MASK)
/*! @} */

/*! @name SLC_10_CSS - Clock Slice 10 Select Status */
/*! @{ */

#define MC_CGM_SLC_10_CSS_SWIP_MASK              (0x4U)
#define MC_CGM_SLC_10_CSS_SWIP_SHIFT             (2U)
#define MC_CGM_SLC_10_CSS_SWIP_WIDTH             (1U)
#define MC_CGM_SLC_10_CSS_SWIP(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_10_CSS_SWIP_SHIFT)) & MC_CGM_SLC_10_CSS_SWIP_MASK)

#define MC_CGM_SLC_10_CSS_SAFESWIP_MASK          (0x8U)
#define MC_CGM_SLC_10_CSS_SAFESWIP_SHIFT         (3U)
#define MC_CGM_SLC_10_CSS_SAFESWIP_WIDTH         (1U)
#define MC_CGM_SLC_10_CSS_SAFESWIP(x)            (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_10_CSS_SAFESWIP_SHIFT)) & MC_CGM_SLC_10_CSS_SAFESWIP_MASK)

#define MC_CGM_SLC_10_CSS_SWTRG_MASK             (0x70000U)
#define MC_CGM_SLC_10_CSS_SWTRG_SHIFT            (16U)
#define MC_CGM_SLC_10_CSS_SWTRG_WIDTH            (3U)
#define MC_CGM_SLC_10_CSS_SWTRG(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_10_CSS_SWTRG_SHIFT)) & MC_CGM_SLC_10_CSS_SWTRG_MASK)

#define MC_CGM_SLC_10_CSS_SELSTAT_MASK           (0x3F000000U)
#define MC_CGM_SLC_10_CSS_SELSTAT_SHIFT          (24U)
#define MC_CGM_SLC_10_CSS_SELSTAT_WIDTH          (6U)
#define MC_CGM_SLC_10_CSS_SELSTAT(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_10_CSS_SELSTAT_SHIFT)) & MC_CGM_SLC_10_CSS_SELSTAT_MASK)
/*! @} */

/*! @name SLC_10_DC_0 - Clock Slice 10 Divider 0 Control */
/*! @{ */

#define MC_CGM_SLC_10_DC_0_DIV_MASK              (0xF0000U)  /* Merged from fields with different position or width, of widths (3, 4), largest definition used */
#define MC_CGM_SLC_10_DC_0_DIV_SHIFT             (16U)
#define MC_CGM_SLC_10_DC_0_DIV_WIDTH             (4U)
#define MC_CGM_SLC_10_DC_0_DIV(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_10_DC_0_DIV_SHIFT)) & MC_CGM_SLC_10_DC_0_DIV_MASK)  /* Merged from fields with different position or width, of widths (3, 4), largest definition used */

#define MC_CGM_SLC_10_DC_0_DE_MASK               (0x80000000U)
#define MC_CGM_SLC_10_DC_0_DE_SHIFT              (31U)
#define MC_CGM_SLC_10_DC_0_DE_WIDTH              (1U)
#define MC_CGM_SLC_10_DC_0_DE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_10_DC_0_DE_SHIFT)) & MC_CGM_SLC_10_DC_0_DE_MASK)
/*! @} */

/*! @name SLC_10_DIV_TRIG_CTRL - Clock Slice 10 Divider Trigger Control */
/*! @{ */

#define MC_CGM_SLC_10_DIV_TRIG_CTRL_IRE_MASK     (0x10000U)
#define MC_CGM_SLC_10_DIV_TRIG_CTRL_IRE_SHIFT    (16U)
#define MC_CGM_SLC_10_DIV_TRIG_CTRL_IRE_WIDTH    (1U)
#define MC_CGM_SLC_10_DIV_TRIG_CTRL_IRE(x)       (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_10_DIV_TRIG_CTRL_IRE_SHIFT)) & MC_CGM_SLC_10_DIV_TRIG_CTRL_IRE_MASK)
/*! @} */

/*! @name SLC_10_DIV_UPD_STAT - Clock Slice 10 Divider Update Status */
/*! @{ */

#define MC_CGM_SLC_10_DIV_UPD_STAT_DIV_STAT_MASK (0x1U)
#define MC_CGM_SLC_10_DIV_UPD_STAT_DIV_STAT_SHIFT (0U)
#define MC_CGM_SLC_10_DIV_UPD_STAT_DIV_STAT_WIDTH (1U)
#define MC_CGM_SLC_10_DIV_UPD_STAT_DIV_STAT(x)   (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_10_DIV_UPD_STAT_DIV_STAT_SHIFT)) & MC_CGM_SLC_10_DIV_UPD_STAT_DIV_STAT_MASK)
/*! @} */

/*! @name SLC_11_CSC - Clock Slice 11 Select Control */
/*! @{ */

#define MC_CGM_SLC_11_CSC_CLK_SW_MASK            (0x4U)
#define MC_CGM_SLC_11_CSC_CLK_SW_SHIFT           (2U)
#define MC_CGM_SLC_11_CSC_CLK_SW_WIDTH           (1U)
#define MC_CGM_SLC_11_CSC_CLK_SW(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_11_CSC_CLK_SW_SHIFT)) & MC_CGM_SLC_11_CSC_CLK_SW_MASK)

#define MC_CGM_SLC_11_CSC_SAFE_SW_MASK           (0x8U)
#define MC_CGM_SLC_11_CSC_SAFE_SW_SHIFT          (3U)
#define MC_CGM_SLC_11_CSC_SAFE_SW_WIDTH          (1U)
#define MC_CGM_SLC_11_CSC_SAFE_SW(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_11_CSC_SAFE_SW_SHIFT)) & MC_CGM_SLC_11_CSC_SAFE_SW_MASK)

