zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_CGM.h
#define MC_CGM_SLC_11_CSC_SELCTL_MASK            (0x3F000000U)
#define MC_CGM_SLC_11_CSC_SELCTL_SHIFT           (24U)
#define MC_CGM_SLC_11_CSC_SELCTL_WIDTH           (6U)
#define MC_CGM_SLC_11_CSC_SELCTL(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_11_CSC_SELCTL_SHIFT)) & MC_CGM_SLC_11_CSC_SELCTL_MASK)
/*! @} */

/*! @name SLC_11_CSS - Clock Slice 11 Select Status */
/*! @{ */

#define MC_CGM_SLC_11_CSS_SWIP_MASK              (0x4U)
#define MC_CGM_SLC_11_CSS_SWIP_SHIFT             (2U)
#define MC_CGM_SLC_11_CSS_SWIP_WIDTH             (1U)
#define MC_CGM_SLC_11_CSS_SWIP(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_11_CSS_SWIP_SHIFT)) & MC_CGM_SLC_11_CSS_SWIP_MASK)

#define MC_CGM_SLC_11_CSS_SAFESWIP_MASK          (0x8U)
#define MC_CGM_SLC_11_CSS_SAFESWIP_SHIFT         (3U)
#define MC_CGM_SLC_11_CSS_SAFESWIP_WIDTH         (1U)
#define MC_CGM_SLC_11_CSS_SAFESWIP(x)            (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_11_CSS_SAFESWIP_SHIFT)) & MC_CGM_SLC_11_CSS_SAFESWIP_MASK)

#define MC_CGM_SLC_11_CSS_SWTRG_MASK             (0x70000U)
#define MC_CGM_SLC_11_CSS_SWTRG_SHIFT            (16U)
#define MC_CGM_SLC_11_CSS_SWTRG_WIDTH            (3U)
#define MC_CGM_SLC_11_CSS_SWTRG(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_11_CSS_SWTRG_SHIFT)) & MC_CGM_SLC_11_CSS_SWTRG_MASK)

#define MC_CGM_SLC_11_CSS_SELSTAT_MASK           (0x3F000000U)
#define MC_CGM_SLC_11_CSS_SELSTAT_SHIFT          (24U)
#define MC_CGM_SLC_11_CSS_SELSTAT_WIDTH          (6U)
#define MC_CGM_SLC_11_CSS_SELSTAT(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_11_CSS_SELSTAT_SHIFT)) & MC_CGM_SLC_11_CSS_SELSTAT_MASK)
/*! @} */

/*! @name SLC_11_DC_0 - Clock Slice 11 Divider 0 Control */
/*! @{ */

#define MC_CGM_SLC_11_DC_0_DIV_MASK              (0xF0000U)  /* Merged from fields with different position or width, of widths (3, 4), largest definition used */
#define MC_CGM_SLC_11_DC_0_DIV_SHIFT             (16U)
#define MC_CGM_SLC_11_DC_0_DIV_WIDTH             (4U)
#define MC_CGM_SLC_11_DC_0_DIV(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_11_DC_0_DIV_SHIFT)) & MC_CGM_SLC_11_DC_0_DIV_MASK)  /* Merged from fields with different position or width, of widths (3, 4), largest definition used */

#define MC_CGM_SLC_11_DC_0_DE_MASK               (0x80000000U)
#define MC_CGM_SLC_11_DC_0_DE_SHIFT              (31U)
#define MC_CGM_SLC_11_DC_0_DE_WIDTH              (1U)
#define MC_CGM_SLC_11_DC_0_DE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_11_DC_0_DE_SHIFT)) & MC_CGM_SLC_11_DC_0_DE_MASK)
/*! @} */

/*! @name SLC_11_DIV_UPD_STAT - Clock Slice 11 Divider Update Status */
/*! @{ */

#define MC_CGM_SLC_11_DIV_UPD_STAT_DIV_STAT_MASK (0x1U)
#define MC_CGM_SLC_11_DIV_UPD_STAT_DIV_STAT_SHIFT (0U)
#define MC_CGM_SLC_11_DIV_UPD_STAT_DIV_STAT_WIDTH (1U)
#define MC_CGM_SLC_11_DIV_UPD_STAT_DIV_STAT(x)   (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_11_DIV_UPD_STAT_DIV_STAT_SHIFT)) & MC_CGM_SLC_11_DIV_UPD_STAT_DIV_STAT_MASK)
/*! @} */

/*! @name SLC_12_CSC - Clock Slice 12 Select Control */
/*! @{ */

#define MC_CGM_SLC_12_CSC_CLK_SW_MASK            (0x4U)
#define MC_CGM_SLC_12_CSC_CLK_SW_SHIFT           (2U)
#define MC_CGM_SLC_12_CSC_CLK_SW_WIDTH           (1U)
#define MC_CGM_SLC_12_CSC_CLK_SW(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_12_CSC_CLK_SW_SHIFT)) & MC_CGM_SLC_12_CSC_CLK_SW_MASK)

#define MC_CGM_SLC_12_CSC_SAFE_SW_MASK           (0x8U)
#define MC_CGM_SLC_12_CSC_SAFE_SW_SHIFT          (3U)
#define MC_CGM_SLC_12_CSC_SAFE_SW_WIDTH          (1U)
#define MC_CGM_SLC_12_CSC_SAFE_SW(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_12_CSC_SAFE_SW_SHIFT)) & MC_CGM_SLC_12_CSC_SAFE_SW_MASK)

#define MC_CGM_SLC_12_CSC_SELCTL_MASK            (0x3F000000U)
#define MC_CGM_SLC_12_CSC_SELCTL_SHIFT           (24U)
#define MC_CGM_SLC_12_CSC_SELCTL_WIDTH           (6U)
#define MC_CGM_SLC_12_CSC_SELCTL(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_12_CSC_SELCTL_SHIFT)) & MC_CGM_SLC_12_CSC_SELCTL_MASK)
/*! @} */

/*! @name SLC_12_CSS - Clock Slice 12 Select Status */
/*! @{ */

#define MC_CGM_SLC_12_CSS_SWIP_MASK              (0x4U)
#define MC_CGM_SLC_12_CSS_SWIP_SHIFT             (2U)
#define MC_CGM_SLC_12_CSS_SWIP_WIDTH             (1U)
#define MC_CGM_SLC_12_CSS_SWIP(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_12_CSS_SWIP_SHIFT)) & MC_CGM_SLC_12_CSS_SWIP_MASK)

#define MC_CGM_SLC_12_CSS_SAFESWIP_MASK          (0x8U)
#define MC_CGM_SLC_12_CSS_SAFESWIP_SHIFT         (3U)
#define MC_CGM_SLC_12_CSS_SAFESWIP_WIDTH         (1U)
#define MC_CGM_SLC_12_CSS_SAFESWIP(x)            (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_12_CSS_SAFESWIP_SHIFT)) & MC_CGM_SLC_12_CSS_SAFESWIP_MASK)

#define MC_CGM_SLC_12_CSS_SWTRG_MASK             (0x70000U)
#define MC_CGM_SLC_12_CSS_SWTRG_SHIFT            (16U)
#define MC_CGM_SLC_12_CSS_SWTRG_WIDTH            (3U)
#define MC_CGM_SLC_12_CSS_SWTRG(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_12_CSS_SWTRG_SHIFT)) & MC_CGM_SLC_12_CSS_SWTRG_MASK)

#define MC_CGM_SLC_12_CSS_SELSTAT_MASK           (0x3F000000U)
#define MC_CGM_SLC_12_CSS_SELSTAT_SHIFT          (24U)
#define MC_CGM_SLC_12_CSS_SELSTAT_WIDTH          (6U)
#define MC_CGM_SLC_12_CSS_SELSTAT(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_12_CSS_SELSTAT_SHIFT)) & MC_CGM_SLC_12_CSS_SELSTAT_MASK)
/*! @} */

/*! @name SLC_12_DC_0 - Clock Slice 12 Divider 0 Control */
/*! @{ */

#define MC_CGM_SLC_12_DC_0_DIV_MASK              (0xF0000U)
#define MC_CGM_SLC_12_DC_0_DIV_SHIFT             (16U)
#define MC_CGM_SLC_12_DC_0_DIV_WIDTH             (4U)
#define MC_CGM_SLC_12_DC_0_DIV(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_12_DC_0_DIV_SHIFT)) & MC_CGM_SLC_12_DC_0_DIV_MASK)

#define MC_CGM_SLC_12_DC_0_DE_MASK               (0x80000000U)
#define MC_CGM_SLC_12_DC_0_DE_SHIFT              (31U)
#define MC_CGM_SLC_12_DC_0_DE_WIDTH              (1U)
#define MC_CGM_SLC_12_DC_0_DE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_12_DC_0_DE_SHIFT)) & MC_CGM_SLC_12_DC_0_DE_MASK)
/*! @} */

/*! @name SLC_12_DIV_UPD_STAT - Clock Slice 12 Divider Update Status */
/*! @{ */

#define MC_CGM_SLC_12_DIV_UPD_STAT_DIV_STAT_MASK (0x1U)
#define MC_CGM_SLC_12_DIV_UPD_STAT_DIV_STAT_SHIFT (0U)
#define MC_CGM_SLC_12_DIV_UPD_STAT_DIV_STAT_WIDTH (1U)
#define MC_CGM_SLC_12_DIV_UPD_STAT_DIV_STAT(x)   (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_12_DIV_UPD_STAT_DIV_STAT_SHIFT)) & MC_CGM_SLC_12_DIV_UPD_STAT_DIV_STAT_MASK)
/*! @} */

/*! @name SLC_13_CSC - Clock Slice 13 Select Control */
/*! @{ */

#define MC_CGM_SLC_13_CSC_CLK_SW_MASK            (0x4U)
#define MC_CGM_SLC_13_CSC_CLK_SW_SHIFT           (2U)
#define MC_CGM_SLC_13_CSC_CLK_SW_WIDTH           (1U)
#define MC_CGM_SLC_13_CSC_CLK_SW(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_13_CSC_CLK_SW_SHIFT)) & MC_CGM_SLC_13_CSC_CLK_SW_MASK)

#define MC_CGM_SLC_13_CSC_SAFE_SW_MASK           (0x8U)
#define MC_CGM_SLC_13_CSC_SAFE_SW_SHIFT          (3U)
#define MC_CGM_SLC_13_CSC_SAFE_SW_WIDTH          (1U)
#define MC_CGM_SLC_13_CSC_SAFE_SW(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_13_CSC_SAFE_SW_SHIFT)) & MC_CGM_SLC_13_CSC_SAFE_SW_MASK)

#define MC_CGM_SLC_13_CSC_SELCTL_MASK            (0x3F000000U)
#define MC_CGM_SLC_13_CSC_SELCTL_SHIFT           (24U)
#define MC_CGM_SLC_13_CSC_SELCTL_WIDTH           (6U)
#define MC_CGM_SLC_13_CSC_SELCTL(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_13_CSC_SELCTL_SHIFT)) & MC_CGM_SLC_13_CSC_SELCTL_MASK)
/*! @} */

/*! @name SLC_13_CSS - Clock Slice 13 Select Status */
/*! @{ */

#define MC_CGM_SLC_13_CSS_SWIP_MASK              (0x4U)
#define MC_CGM_SLC_13_CSS_SWIP_SHIFT             (2U)
#define MC_CGM_SLC_13_CSS_SWIP_WIDTH             (1U)
#define MC_CGM_SLC_13_CSS_SWIP(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_13_CSS_SWIP_SHIFT)) & MC_CGM_SLC_13_CSS_SWIP_MASK)

#define MC_CGM_SLC_13_CSS_SAFESWIP_MASK          (0x8U)
#define MC_CGM_SLC_13_CSS_SAFESWIP_SHIFT         (3U)
#define MC_CGM_SLC_13_CSS_SAFESWIP_WIDTH         (1U)
#define MC_CGM_SLC_13_CSS_SAFESWIP(x)            (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_13_CSS_SAFESWIP_SHIFT)) & MC_CGM_SLC_13_CSS_SAFESWIP_MASK)

#define MC_CGM_SLC_13_CSS_SWTRG_MASK             (0x70000U)
#define MC_CGM_SLC_13_CSS_SWTRG_SHIFT            (16U)
#define MC_CGM_SLC_13_CSS_SWTRG_WIDTH            (3U)
#define MC_CGM_SLC_13_CSS_SWTRG(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_13_CSS_SWTRG_SHIFT)) & MC_CGM_SLC_13_CSS_SWTRG_MASK)

#define MC_CGM_SLC_13_CSS_SELSTAT_MASK           (0x3F000000U)
#define MC_CGM_SLC_13_CSS_SELSTAT_SHIFT          (24U)
#define MC_CGM_SLC_13_CSS_SELSTAT_WIDTH          (6U)
#define MC_CGM_SLC_13_CSS_SELSTAT(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_13_CSS_SELSTAT_SHIFT)) & MC_CGM_SLC_13_CSS_SELSTAT_MASK)
/*! @} */

/*! @name SLC_13_DC_0 - Clock Slice 13 Divider 0 Control */
/*! @{ */

#define MC_CGM_SLC_13_DC_0_DIV_MASK              (0xFF0000U)  /* Merged from fields with different position or width, of widths (4, 8), largest definition used */
#define MC_CGM_SLC_13_DC_0_DIV_SHIFT             (16U)
#define MC_CGM_SLC_13_DC_0_DIV_WIDTH             (8U)
#define MC_CGM_SLC_13_DC_0_DIV(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_13_DC_0_DIV_SHIFT)) & MC_CGM_SLC_13_DC_0_DIV_MASK)  /* Merged from fields with different position or width, of widths (4, 8), largest definition used */

#define MC_CGM_SLC_13_DC_0_DE_MASK               (0x80000000U)
#define MC_CGM_SLC_13_DC_0_DE_SHIFT              (31U)
#define MC_CGM_SLC_13_DC_0_DE_WIDTH              (1U)
#define MC_CGM_SLC_13_DC_0_DE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_13_DC_0_DE_SHIFT)) & MC_CGM_SLC_13_DC_0_DE_MASK)
/*! @} */

/*! @name SLC_13_DIV_UPD_STAT - Clock Slice 13 Divider Update Status */
/*! @{ */

#define MC_CGM_SLC_13_DIV_UPD_STAT_DIV_STAT_MASK (0x1U)
#define MC_CGM_SLC_13_DIV_UPD_STAT_DIV_STAT_SHIFT (0U)
#define MC_CGM_SLC_13_DIV_UPD_STAT_DIV_STAT_WIDTH (1U)
#define MC_CGM_SLC_13_DIV_UPD_STAT_DIV_STAT(x)   (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_13_DIV_UPD_STAT_DIV_STAT_SHIFT)) & MC_CGM_SLC_13_DIV_UPD_STAT_DIV_STAT_MASK)
/*! @} */

/*! @name SLC_14_CSC - Clock Slice 14 Select Control */
/*! @{ */

