zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_MC_CGM.h
#define MC_CGM_SLC_14_CSC_CLK_SW_MASK            (0x4U)
#define MC_CGM_SLC_14_CSC_CLK_SW_SHIFT           (2U)
#define MC_CGM_SLC_14_CSC_CLK_SW_WIDTH           (1U)
#define MC_CGM_SLC_14_CSC_CLK_SW(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_14_CSC_CLK_SW_SHIFT)) & MC_CGM_SLC_14_CSC_CLK_SW_MASK)

#define MC_CGM_SLC_14_CSC_SAFE_SW_MASK           (0x8U)
#define MC_CGM_SLC_14_CSC_SAFE_SW_SHIFT          (3U)
#define MC_CGM_SLC_14_CSC_SAFE_SW_WIDTH          (1U)
#define MC_CGM_SLC_14_CSC_SAFE_SW(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_14_CSC_SAFE_SW_SHIFT)) & MC_CGM_SLC_14_CSC_SAFE_SW_MASK)

#define MC_CGM_SLC_14_CSC_SELCTL_MASK            (0x3F000000U)
#define MC_CGM_SLC_14_CSC_SELCTL_SHIFT           (24U)
#define MC_CGM_SLC_14_CSC_SELCTL_WIDTH           (6U)
#define MC_CGM_SLC_14_CSC_SELCTL(x)              (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_14_CSC_SELCTL_SHIFT)) & MC_CGM_SLC_14_CSC_SELCTL_MASK)
/*! @} */

/*! @name SLC_14_CSS - Clock Slice 14 Select Status */
/*! @{ */

#define MC_CGM_SLC_14_CSS_SWIP_MASK              (0x4U)
#define MC_CGM_SLC_14_CSS_SWIP_SHIFT             (2U)
#define MC_CGM_SLC_14_CSS_SWIP_WIDTH             (1U)
#define MC_CGM_SLC_14_CSS_SWIP(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_14_CSS_SWIP_SHIFT)) & MC_CGM_SLC_14_CSS_SWIP_MASK)

#define MC_CGM_SLC_14_CSS_SAFESWIP_MASK          (0x8U)
#define MC_CGM_SLC_14_CSS_SAFESWIP_SHIFT         (3U)
#define MC_CGM_SLC_14_CSS_SAFESWIP_WIDTH         (1U)
#define MC_CGM_SLC_14_CSS_SAFESWIP(x)            (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_14_CSS_SAFESWIP_SHIFT)) & MC_CGM_SLC_14_CSS_SAFESWIP_MASK)

#define MC_CGM_SLC_14_CSS_SWTRG_MASK             (0x70000U)
#define MC_CGM_SLC_14_CSS_SWTRG_SHIFT            (16U)
#define MC_CGM_SLC_14_CSS_SWTRG_WIDTH            (3U)
#define MC_CGM_SLC_14_CSS_SWTRG(x)               (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_14_CSS_SWTRG_SHIFT)) & MC_CGM_SLC_14_CSS_SWTRG_MASK)

#define MC_CGM_SLC_14_CSS_SELSTAT_MASK           (0x3F000000U)
#define MC_CGM_SLC_14_CSS_SELSTAT_SHIFT          (24U)
#define MC_CGM_SLC_14_CSS_SELSTAT_WIDTH          (6U)
#define MC_CGM_SLC_14_CSS_SELSTAT(x)             (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_14_CSS_SELSTAT_SHIFT)) & MC_CGM_SLC_14_CSS_SELSTAT_MASK)
/*! @} */

/*! @name SLC_14_DC_0 - Clock Slice 14 Divider 0 Control */
/*! @{ */

#define MC_CGM_SLC_14_DC_0_DIV_MASK              (0xF0000U)
#define MC_CGM_SLC_14_DC_0_DIV_SHIFT             (16U)
#define MC_CGM_SLC_14_DC_0_DIV_WIDTH             (4U)
#define MC_CGM_SLC_14_DC_0_DIV(x)                (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_14_DC_0_DIV_SHIFT)) & MC_CGM_SLC_14_DC_0_DIV_MASK)

#define MC_CGM_SLC_14_DC_0_DE_MASK               (0x80000000U)
#define MC_CGM_SLC_14_DC_0_DE_SHIFT              (31U)
#define MC_CGM_SLC_14_DC_0_DE_WIDTH              (1U)
#define MC_CGM_SLC_14_DC_0_DE(x)                 (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_14_DC_0_DE_SHIFT)) & MC_CGM_SLC_14_DC_0_DE_MASK)
/*! @} */

/*! @name SLC_14_DIV_UPD_STAT - Clock Slice 14 Divider Update Status */
/*! @{ */

#define MC_CGM_SLC_14_DIV_UPD_STAT_DIV_STAT_MASK (0x1U)
#define MC_CGM_SLC_14_DIV_UPD_STAT_DIV_STAT_SHIFT (0U)
#define MC_CGM_SLC_14_DIV_UPD_STAT_DIV_STAT_WIDTH (1U)
#define MC_CGM_SLC_14_DIV_UPD_STAT_DIV_STAT(x)   (((uint32_t)(((uint32_t)(x)) << MC_CGM_SLC_14_DIV_UPD_STAT_DIV_STAT_SHIFT)) & MC_CGM_SLC_14_DIV_UPD_STAT_DIV_STAT_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group MC_CGM_Register_Masks */

/*!
 * @}
 */ /* end of group MC_CGM_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_MC_CGM_H_) */
